[Killed] ConditionalExpression
src/commands/update.ts:21:7
   const manifest = await readManifest()
   const clis: CLI[] = manifest.clis
 
-  if (clis.length === 0) {
+  if (true) {
     return { clis: [], steps: [] }
   }
killedBy: runUpdate calls runInstall with manifest CLIs and all 4 features
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Number of calls: 0

[Killed] EqualityOperator
src/commands/update.ts:21:7
   const manifest = await readManifest()
   const clis: CLI[] = manifest.clis
 
-  if (clis.length === 0) {
+  if (clis.length !== 0) {
     return { clis: [], steps: [] }
   }
killedBy: runUpdate returns early result when manifest has no CLIs
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] BlockStatement
src/commands/update.ts:26:44
   }
 
   const steps: InstallStep[] = []
-  const trackStep = (step: InstallStep) => {
-    const idx = steps.findIndex(s => s.id === step.id)
-    if (idx >= 0) {
-      steps[idx] = step
-    } else {
-      steps.push(step)
-    }
-    onStep(step)
-  }
+  const trackStep = (step: InstallStep) => {}
 
   await runInstall(
killedBy: runUpdate trackStep: first step is pushed to steps array
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/commands/update.ts:27:38
 
   const steps: InstallStep[] = []
   const trackStep = (step: InstallStep) => {
-    const idx = steps.findIndex(s => s.id === step.id)
+    const idx = steps.findIndex(s => false)
     if (idx >= 0) {
       steps[idx] = step
killedBy: runUpdate trackStep: second call with same id replaces first (upsert by id)
statusReason: expected [ { id: 'step-1', …(2) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/commands/update.ts:27:38
 
   const steps: InstallStep[] = []
   const trackStep = (step: InstallStep) => {
-    const idx = steps.findIndex(s => s.id === step.id)
+    const idx = steps.findIndex(s => true)
     if (idx >= 0) {
       steps[idx] = step
killedBy: runUpdate trackStep: step with new id is appended
statusReason: expected [ { id: 'step-2', …(2) } ] to have a length of 2 but got 1

[Killed] BlockStatement
src/commands/update.ts:28:19
   const steps: InstallStep[] = []
   const trackStep = (step: InstallStep) => {
     const idx = steps.findIndex(s => s.id === step.id)
-    if (idx >= 0) {
-      steps[idx] = step
-    } else {
+    if (idx >= 0) {} else {
       steps.push(step)
     }
killedBy: runUpdate trackStep: second call with same id replaces first (upsert by id)
statusReason: expected 'running' to be 'done' // Object.is equality

[Killed] EqualityOperator
src/commands/update.ts:28:9
   const steps: InstallStep[] = []
   const trackStep = (step: InstallStep) => {
     const idx = steps.findIndex(s => s.id === step.id)
-    if (idx >= 0) {
+    if (idx < 0) {
       steps[idx] = step
     } else {
killedBy: runUpdate trackStep: first step is pushed to steps array
statusReason: expected [ , '-1': { id: 'step-1', …(2) } ] to have a length of 1 but got +0

[Killed] BlockStatement
src/commands/update.ts:30:12
     const idx = steps.findIndex(s => s.id === step.id)
     if (idx >= 0) {
       steps[idx] = step
-    } else {
-      steps.push(step)
-    }
+    } else {}
     onStep(step)
   }
killedBy: runUpdate trackStep: first step is pushed to steps array
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrayDeclaration
src/commands/update.ts:39:17
   await runInstall(
     {
       clis,
-      features: ['skills', 'orchestrators', 'configs', 'hooks'],
+      features: [],
       dryRun: options.dryRun ?? false,
       backup: true,
killedBy: runUpdate calls runInstall with manifest CLIs and all 4 features
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/commands/update.ts:40:33
     {
       clis,
       features: ['skills', 'orchestrators', 'configs', 'hooks'],
-      dryRun: options.dryRun ?? false,
+      dryRun: options.dryRun ?? true,
       backup: true,
     },
killedBy: runUpdate defaults dryRun to false when not specified
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/commands/update.ts:41:15
       clis,
       features: ['skills', 'orchestrators', 'configs', 'hooks'],
       dryRun: options.dryRun ?? false,
-      backup: true,
+      backup: false,
     },
     trackStep
killedBy: runUpdate calls runInstall with manifest CLIs and all 4 features
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received:

  1st vi.fn() call:

@@ -1,8 +1,8 @@
  [
