[Killed] LogicalOperator
src/commands/doctor.ts:36:12
 async function which(bin: string): Promise<string | null> {
   try {
     const { stdout } = await execFileAsync('which', [bin])
-    return stdout.trim() || null
+    return stdout.trim() && null
   } catch {
     return null
killedBy: runDoctor CLI in manifest + found in PATH: cli status = ok
statusReason: expected 'fail' to be 'ok' // Object.is equality

[Survived] MethodExpression
src/commands/doctor.ts:36:12
 async function which(bin: string): Promise<string | null> {
   try {
     const { stdout } = await execFileAsync('which', [bin])
-    return stdout.trim() || null
+    return stdout || null
   } catch {
     return null

[Killed] ConditionalExpression
src/commands/doctor.ts:44:7
 
 /** Count skill dirs at a given path (only direct subdirectories with a SKILL.md) */
 async function countInstalledSkills(skillsPath: string): Promise<number> {
-  if (!await fs.pathExists(skillsPath)) return 0
+  if (true) return 0
   const entries = await fs.readdir(skillsPath)
   let count = 0
killedBy: runDoctor skill count matches expected: status ok
statusReason: expected 'fail' to be 'ok' // Object.is equality

[Killed] BooleanLiteral
src/commands/doctor.ts:44:7
 
 /** Count skill dirs at a given path (only direct subdirectories with a SKILL.md) */
 async function countInstalledSkills(skillsPath: string): Promise<number> {
-  if (!await fs.pathExists(skillsPath)) return 0
+  if (await fs.pathExists(skillsPath)) return 0
   const entries = await fs.readdir(skillsPath)
   let count = 0
killedBy: runDoctor manifest with 2 CLIs: shows them listed
statusReason: ENOENT: no such file or directory, scandir '/tmp/javi-ai-doctor-3c50b78f-4442-4d3a-a21b-5fe6a1691b23/claude-skills'

[Killed] BlockStatement
src/commands/doctor.ts:47:32
   if (!await fs.pathExists(skillsPath)) return 0
   const entries = await fs.readdir(skillsPath)
   let count = 0
-  for (const entry of entries) {
-    const skillMd = path.join(skillsPath, entry, 'SKILL.md')
-    if (await fs.pathExists(skillMd)) count++
-  }
+  for (const entry of entries) {}
   return count
 }
killedBy: runDoctor skill count matches expected: status ok
statusReason: expected 'fail' to be 'ok' // Object.is equality

[Killed] ConditionalExpression
src/commands/doctor.ts:49:9
   let count = 0
   for (const entry of entries) {
     const skillMd = path.join(skillsPath, entry, 'SKILL.md')
-    if (await fs.pathExists(skillMd)) count++
+    if (true) count++
   }
   return count
killedBy: runDoctor skill count: installed skills WITHOUT SKILL.md are not counted
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] UpdateOperator
src/commands/doctor.ts:49:39
   let count = 0
   for (const entry of entries) {
     const skillMd = path.join(skillsPath, entry, 'SKILL.md')
-    if (await fs.pathExists(skillMd)) count++
+    if (await fs.pathExists(skillMd)) count--
   }
   return count
killedBy: runDoctor skill count matches expected: status ok
statusReason: expected 'fail' to be 'ok' // Object.is equality

[Killed] StringLiteral
src/commands/doctor.ts:57:48
 /** Count skills that javi-ai would install (upstream + own, deduped) */
 async function countExpectedSkills(): Promise<number> {
   const upstreamSrc = path.join(ASSETS_ROOT, 'upstream', 'skills')
-  const ownSrc = path.join(ASSETS_ROOT, 'own', 'skills')
+  const ownSrc = path.join(ASSETS_ROOT, 'own', "")
   const names = new Set<string>()
 
killedBy: runDoctor countExpectedSkills: same skill name in own/ and upstream/ is only counted once
statusReason: expected 'fail' to be 'ok' // Object.is equality

[Killed] ConditionalExpression
src/commands/doctor.ts:60:7
   const ownSrc = path.join(ASSETS_ROOT, 'own', 'skills')
   const names = new Set<string>()
 
-  if (await fs.pathExists(upstreamSrc)) {
+  if (false) {
     const dirs = await fs.readdir(upstreamSrc)
     for (const d of dirs) {
killedBy: runDoctor skill count below expected: status fail
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] BlockStatement
src/commands/doctor.ts:60:41
   const ownSrc = path.join(ASSETS_ROOT, 'own', 'skills')
   const names = new Set<string>()
 
-  if (await fs.pathExists(upstreamSrc)) {
-    const dirs = await fs.readdir(upstreamSrc)
-    for (const d of dirs) {
-      if (d.startsWith('.') || d === '_shared') continue
-      if (await fs.pathExists(path.join(upstreamSrc, d, 'SKILL.md'))) {
-        names.add(d)
-      }
-    }
-  }
+  if (await fs.pathExists(upstreamSrc)) {}
 
   if (await fs.pathExists(ownSrc)) {
killedBy: runDoctor skill count below expected: status fail
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] BlockStatement
src/commands/doctor.ts:62:27
 
   if (await fs.pathExists(upstreamSrc)) {
     const dirs = await fs.readdir(upstreamSrc)
-    for (const d of dirs) {
-      if (d.startsWith('.') || d === '_shared') continue
-      if (await fs.pathExists(path.join(upstreamSrc, d, 'SKILL.md'))) {
-        names.add(d)
-      }
-    }
+    for (const d of dirs) {}
   }
 
killedBy: runDoctor skill count below expected: status fail
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] ConditionalExpression
src/commands/doctor.ts:63:32
   if (await fs.pathExists(upstreamSrc)) {
     const dirs = await fs.readdir(upstreamSrc)
     for (const d of dirs) {
-      if (d.startsWith('.') || d === '_shared') continue
+      if (d.startsWith('.') || false) continue
       if (await fs.pathExists(path.join(upstreamSrc, d, 'SKILL.md'))) {
         names.add(d)
killedBy: runDoctor countExpectedSkills: upstream dot-dirs and _shared are excluded
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-doctor-assets-test/upstream/skills/_shared/SKILL.md'

[Killed] LogicalOperator
src/commands/doctor.ts:63:11
   if (await fs.pathExists(upstreamSrc)) {
     const dirs = await fs.readdir(upstreamSrc)
     for (const d of dirs) {
-      if (d.startsWith('.') || d === '_shared') continue
+      if (d.startsWith('.') && d === '_shared') continue
       if (await fs.pathExists(path.join(upstreamSrc, d, 'SKILL.md'))) {
         names.add(d)
killedBy: runDoctor countExpectedSkills: upstream dot-dirs and _shared are excluded
statusReason: expected '1/3 skills present' to contain '1/1'

[Killed] BlockStatement
src/commands/doctor.ts:64:71
     const dirs = await fs.readdir(upstreamSrc)
     for (const d of dirs) {
       if (d.startsWith('.') || d === '_shared') continue
-      if (await fs.pathExists(path.join(upstreamSrc, d, 'SKILL.md'))) {
-        names.add(d)
-      }
+      if (await fs.pathExists(path.join(upstreamSrc, d, 'SKILL.md'))) {}
     }
   }
killedBy: runDoctor skill count below expected: status fail
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] ConditionalExpression
src/commands/doctor.ts:64:11
     const dirs = await fs.readdir(upstreamSrc)
     for (const d of dirs) {
       if (d.startsWith('.') || d === '_shared') continue
-      if (await fs.pathExists(path.join(upstreamSrc, d, 'SKILL.md'))) {
+      if (true) {
         names.add(d)
       }
killedBy: runDoctor countExpectedSkills: upstream skills without SKILL.md are excluded
statusReason: expected '1/2 skills present' to contain '1/1'

[Killed] ConditionalExpression
src/commands/doctor.ts:70:7
     }
   }
 
-  if (await fs.pathExists(ownSrc)) {
+  if (true) {
     const dirs = await fs.readdir(ownSrc)
     for (const d of dirs) {
killedBy: runDoctor no manifest: installation section shows installed=false
statusReason: ENOENT: no such file or directory, scandir '/tmp/javi-ai-doctor-assets-test/own/skills'

[Killed] ConditionalExpression
src/commands/doctor.ts:70:7
     }
   }
 
-  if (await fs.pathExists(ownSrc)) {
+  if (false) {
     const dirs = await fs.readdir(ownSrc)
     for (const d of dirs) {
killedBy: runDoctor skill count: present === expected - 1 → fail
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] BlockStatement
src/commands/doctor.ts:72:27
 
   if (await fs.pathExists(ownSrc)) {
     const dirs = await fs.readdir(ownSrc)
-    for (const d of dirs) {
-      if (!d.startsWith('.')) names.add(d)
-    }
+    for (const d of dirs) {}
   }
 
killedBy: runDoctor no manifest: installation section shows installed=false
statusReason: ENOTEMPTY: directory not empty, rmdir '/tmp/javi-ai-doctor-assets-test'

[Killed] ConditionalExpression
src/commands/doctor.ts:73:11
   if (await fs.pathExists(ownSrc)) {
     const dirs = await fs.readdir(ownSrc)
     for (const d of dirs) {
-      if (!d.startsWith('.')) names.add(d)
+      if (true) names.add(d)
     }
   }
killedBy: runDoctor hooks access success → detail says "executable"
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-doctor-assets-test/own/hooks/claude/exec.sh'

[Killed] BooleanLiteral
src/commands/doctor.ts:73:11
   if (await fs.pathExists(ownSrc)) {
     const dirs = await fs.readdir(ownSrc)
     for (const d of dirs) {
-      if (!d.startsWith('.')) names.add(d)
+      if (d.startsWith('.')) names.add(d)
     }
   }
killedBy: runDoctor backups: "No backup directory" label is non-empty
statusReason: ENOTEMPTY: directory not empty, rmdir '/tmp/javi-ai-doctor-assets-test/own'

[Killed] ArrayDeclaration
src/commands/doctor.ts:81:76
 }
 
 /** Config files that javi-ai manages per CLI */
-const CONFIG_FILES: Array<{ cli: CLI; label: string; filePath: string }> = [
-  { cli: 'claude',    label: '~/.claude/CLAUDE.md',                    filePath: path.join(process.env['HOME'] ?? '~', '.claude', 'CLAUDE.md') },
-  { cli: 'opencode',  label: '~/.config/opencode/opencode.json',        filePath: path.join(process.env['HOME'] ?? '~', '.config', 'opencode', 'opencode.json') },
-  { cli: 'gemini',    label: '~/.gemini/GEMINI.md',                     filePath: path.join(process.env['HOME'] ?? '~', '.gemini', 'GEMINI.md') },
-  { cli: 'qwen',      label: '~/.qwen/QWEN.md',                         filePath: path.join(process.env['HOME'] ?? '~', '.qwen', 'QWEN.md') },
-  { cli: 'codex',     label: '~/.codex/AGENTS.md',                      filePath: path.join(process.env['HOME'] ?? '~', '.codex', 'AGENTS.md') },
-  { cli: 'copilot',   label: '~/.copilot/COPILOT.md',                   filePath: path.join(process.env['HOME'] ?? '~', '.copilot', 'COPILOT.md') },
-]
+const CONFIG_FILES: Array<{ cli: CLI; label: string; filePath: string }> = []
 
 export async function runDoctor(): Promise<DoctorResult> {
killedBy: runDoctor config file present: section has ok/fail checks (not skip) for installed CLI
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/commands/doctor.ts:82:131
 
 /** Config files that javi-ai manages per CLI */
 const CONFIG_FILES: Array<{ cli: CLI; label: string; filePath: string }> = [
-  { cli: 'claude',    label: '~/.claude/CLAUDE.md',                    filePath: path.join(process.env['HOME'] ?? '~', '.claude', 'CLAUDE.md') },
+  { cli: 'claude',    label: '~/.claude/CLAUDE.md',                    filePath: path.join(process.env['HOME'] ?? '~', '.claude', "") },
   { cli: 'opencode',  label: '~/.config/opencode/opencode.json',        filePath: path.join(process.env['HOME'] ?? '~', '.config', 'opencode', 'opencode.json') },
   { cli: 'gemini',    label: '~/.gemini/GEMINI.md',                     filePath: path.join(process.env['HOME'] ?? '~', '.gemini', 'GEMINI.md') },
killedBy: runDoctor hooks check: hookChecks.length === 0 after hook loop shows skip
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/commands/doctor.ts:82:104
 
 /** Config files that javi-ai manages per CLI */
 const CONFIG_FILES: Array<{ cli: CLI; label: string; filePath: string }> = [
-  { cli: 'claude',    label: '~/.claude/CLAUDE.md',                    filePath: path.join(process.env['HOME'] ?? '~', '.claude', 'CLAUDE.md') },
+  { cli: 'claude',    label: '~/.claude/CLAUDE.md',                    filePath: path.join(process.env[""] ?? '~', '.claude', 'CLAUDE.md') },
   { cli: 'opencode',  label: '~/.config/opencode/opencode.json',        filePath: path.join(process.env['HOME'] ?? '~', '.config', 'opencode', 'opencode.json') },
   { cli: 'gemini',    label: '~/.gemini/GEMINI.md',                     filePath: path.join(process.env['HOME'] ?? '~', '.gemini', 'GEMINI.md') },
killedBy: runDoctor hooks pathExists false → status fail with "not found" detail
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-doctor-assets-test/own/hooks/claude/absent-hook.sh'

[Killed] StringLiteral
src/commands/doctor.ts:83:144
 /** Config files that javi-ai manages per CLI */
 const CONFIG_FILES: Array<{ cli: CLI; label: string; filePath: string }> = [
   { cli: 'claude',    label: '~/.claude/CLAUDE.md',                    filePath: path.join(process.env['HOME'] ?? '~', '.claude', 'CLAUDE.md') },
-  { cli: 'opencode',  label: '~/.config/opencode/opencode.json',        filePath: path.join(process.env['HOME'] ?? '~', '.config', 'opencode', 'opencode.json') },
+  { cli: 'opencode',  label: '~/.config/opencode/opencode.json',        filePath: path.join(process.env['HOME'] ?? '~', '.config', 'opencode', "") },
   { cli: 'gemini',    label: '~/.gemini/GEMINI.md',                     filePath: path.join(process.env['HOME'] ?? '~', '.gemini', 'GEMINI.md') },
   { cli: 'qwen',      label: '~/.qwen/QWEN.md',                         filePath: path.join(process.env['HOME'] ?? '~', '.qwen', 'QWEN.md') },
killedBy: runDoctor no manifest: installation section shows installed=false
statusReason: ENOTEMPTY: directory not empty, rmdir '/tmp/javi-ai-doctor-assets-test/upstream/skills'

[Killed] StringLiteral
src/commands/doctor.ts:83:30
 /** Config files that javi-ai manages per CLI */
 const CONFIG_FILES: Array<{ cli: CLI; label: string; filePath: string }> = [
   { cli: 'claude',    label: '~/.claude/CLAUDE.md',                    filePath: path.join(process.env['HOME'] ?? '~', '.claude', 'CLAUDE.md') },
-  { cli: 'opencode',  label: '~/.config/opencode/opencode.json',        filePath: path.join(process.env['HOME'] ?? '~', '.config', 'opencode', 'opencode.json') },
+  { cli: 'opencode',  label: "",        filePath: path.join(process.env['HOME'] ?? '~', '.config', 'opencode', 'opencode.json') },
   { cli: 'gemini',    label: '~/.gemini/GEMINI.md',                     filePath: path.join(process.env['HOME'] ?? '~', '.gemini', 'GEMINI.md') },
   { cli: 'qwen',      label: '~/.qwen/QWEN.md',                         filePath: path.join(process.env['HOME'] ?? '~', '.qwen', 'QWEN.md') },
killedBy: runDoctor skill count matches expected: status ok
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-doctor-assets-test/upstream/skills/react-19/SKILL.md'

[Killed] StringLiteral
src/commands/doctor.ts:84:30
 const CONFIG_FILES: Array<{ cli: CLI; label: string; filePath: string }> = [
   { cli: 'claude',    label: '~/.claude/CLAUDE.md',                    filePath: path.join(process.env['HOME'] ?? '~', '.claude', 'CLAUDE.md') },
   { cli: 'opencode',  label: '~/.config/opencode/opencode.json',        filePath: path.join(process.env['HOME'] ?? '~', '.config', 'opencode', 'opencode.json') },
-  { cli: 'gemini',    label: '~/.gemini/GEMINI.md',                     filePath: path.join(process.env['HOME'] ?? '~', '.gemini', 'GEMINI.md') },
+  { cli: 'gemini',    label: "",                     filePath: path.join(process.env['HOME'] ?? '~', '.gemini', 'GEMINI.md') },
   { cli: 'qwen',      label: '~/.qwen/QWEN.md',                         filePath: path.join(process.env['HOME'] ?? '~', '.qwen', 'QWEN.md') },
   { cli: 'codex',     label: '~/.codex/AGENTS.md',                      filePath: path.join(process.env['HOME'] ?? '~', '.codex', 'AGENTS.md') },
killedBy: runDoctor skill count: present === expected - 1 → fail
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] StringLiteral
src/commands/doctor.ts:86:131
   { cli: 'opencode',  label: '~/.config/opencode/opencode.json',        filePath: path.join(process.env['HOME'] ?? '~', '.config', 'opencode', 'opencode.json') },
   { cli: 'gemini',    label: '~/.gemini/GEMINI.md',                     filePath: path.join(process.env['HOME'] ?? '~', '.gemini', 'GEMINI.md') },
   { cli: 'qwen',      label: '~/.qwen/QWEN.md',                         filePath: path.join(process.env['HOME'] ?? '~', '.qwen', 'QWEN.md') },
-  { cli: 'codex',     label: '~/.codex/AGENTS.md',                      filePath: path.join(process.env['HOME'] ?? '~', '.codex', 'AGENTS.md') },
+  { cli: 'codex',     label: '~/.codex/AGENTS.md',                      filePath: path.join(process.env['HOME'] ?? '~', '.codex', "") },
   { cli: 'copilot',   label: '~/.copilot/COPILOT.md',                   filePath: path.join(process.env['HOME'] ?? '~', '.copilot', 'COPILOT.md') },
 ]
killedBy: runDoctor skill count below expected: status fail
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] StringLiteral
src/commands/doctor.ts:86:121
   { cli: 'opencode',  label: '~/.config/opencode/opencode.json',        filePath: path.join(process.env['HOME'] ?? '~', '.config', 'opencode', 'opencode.json') },
   { cli: 'gemini',    label: '~/.gemini/GEMINI.md',                     filePath: path.join(process.env['HOME'] ?? '~', '.gemini', 'GEMINI.md') },
   { cli: 'qwen',      label: '~/.qwen/QWEN.md',                         filePath: path.join(process.env['HOME'] ?? '~', '.qwen', 'QWEN.md') },
-  { cli: 'codex',     label: '~/.codex/AGENTS.md',                      filePath: path.join(process.env['HOME'] ?? '~', '.codex', 'AGENTS.md') },
+  { cli: 'codex',     label: '~/.codex/AGENTS.md',                      filePath: path.join(process.env['HOME'] ?? '~', "", 'AGENTS.md') },
   { cli: 'copilot',   label: '~/.copilot/COPILOT.md',                   filePath: path.join(process.env['HOME'] ?? '~', '.copilot', 'COPILOT.md') },
 ]
killedBy: runDoctor hook check: hook file exists but is not executable → status fail
statusReason: ENOENT: no such file or directory, scandir '/tmp/javi-ai-doctor-assets-test/own/hooks/claude'

[Survived] StringLiteral
src/commands/doctor.ts:87:121
   { cli: 'gemini',    label: '~/.gemini/GEMINI.md',                     filePath: path.join(process.env['HOME'] ?? '~', '.gemini', 'GEMINI.md') },
   { cli: 'qwen',      label: '~/.qwen/QWEN.md',                         filePath: path.join(process.env['HOME'] ?? '~', '.qwen', 'QWEN.md') },
   { cli: 'codex',     label: '~/.codex/AGENTS.md',                      filePath: path.join(process.env['HOME'] ?? '~', '.codex', 'AGENTS.md') },
-  { cli: 'copilot',   label: '~/.copilot/COPILOT.md',                   filePath: path.join(process.env['HOME'] ?? '~', '.copilot', 'COPILOT.md') },
+  { cli: 'copilot',   label: '~/.copilot/COPILOT.md',                   filePath: path.join(process.env['HOME'] ?? '~', "", 'COPILOT.md') },
 ]
 

[Killed] BlockStatement
src/commands/doctor.ts:99:31
   // ── 1. Installation ────────────────────────────────────────────────────────
   const installChecks: DoctorCheck[] = []
 
-  if (installedClis.size > 0) {
-    installChecks.push({
-      label: `Installed on ${manifest.installedAt.split('T')[0]}  (last updated: ${manifest.updatedAt.split('T')[0]})`,
-      status: 'ok',
-    })
-    installChecks.push({
-      label: `CLIs configured: ${[...installedClis].join(', ')}`,
-      status: 'ok',
-    })
-  } else {
+  if (installedClis.size > 0) {} else {
     installChecks.push({
       label: 'No installation found',
killedBy: runDoctor manifest with 2 CLIs: shows them listed
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/commands/doctor.ts:99:7
   // ── 1. Installation ────────────────────────────────────────────────────────
   const installChecks: DoctorCheck[] = []
 
-  if (installedClis.size > 0) {
+  if (true) {
     installChecks.push({
       label: `Installed on ${manifest.installedAt.split('T')[0]}  (last updated: ${manifest.updatedAt.split('T')[0]})`,
killedBy: runDoctor no manifest: installation section shows installed=false
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/commands/doctor.ts:101:57
 
   if (installedClis.size > 0) {
     installChecks.push({
-      label: `Installed on ${manifest.installedAt.split('T')[0]}  (last updated: ${manifest.updatedAt.split('T')[0]})`,
+      label: `Installed on ${manifest.installedAt.split("")[0]}  (last updated: ${manifest.updatedAt.split('T')[0]})`,
       status: 'ok',
     })
killedBy: runDoctor skill count below expected: status fail
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] StringLiteral
src/commands/doctor.ts:105:58
       status: 'ok',
     })
     installChecks.push({
-      label: `CLIs configured: ${[...installedClis].join(', ')}`,
+      label: `CLIs configured: ${[...installedClis].join("")}`,
       status: 'ok',
     })
killedBy: runDoctor cli detection: when join uses separator, multiple CLIs shown comma-separated
statusReason: expected 'CLIs configured: claudeopencode' to contain ', '

[Killed] BlockStatement
src/commands/doctor.ts:108:10
       label: `CLIs configured: ${[...installedClis].join(', ')}`,
       status: 'ok',
     })
-  } else {
-    installChecks.push({
-      label: 'No installation found',
-      status: 'fail',
-      detail: 'Run javi-ai to install',
-    })
-  }
+  } else {}
 
   sections.push({ title: 'Installation', checks: installChecks })
killedBy: runDoctor no manifest: installation section shows installed=false
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/commands/doctor.ts:120:34
 
   // ── 2. CLI Detection ───────────────────────────────────────────────────────
   const cliChecks: DoctorCheck[] = []
-  for (const opt of CLI_OPTIONS) {
-    const bin = await which(opt.id)
-    if (!installedClis.has(opt.id)) {
-      cliChecks.push({ label: opt.id.padEnd(12), status: 'skip', detail: 'not installed via javi-ai' })
-    } else if (bin) {
-      cliChecks.push({ label: opt.id.padEnd(12), status: 'ok', detail: `found at ${bin}` })
-    } else {
-      cliChecks.push({ label: opt.id.padEnd(12), status: 'fail', detail: 'not found in PATH' })
-    }
-  }
+  for (const opt of CLI_OPTIONS) {}
   sections.push({ title: 'CLI Detection', checks: cliChecks })
 
killedBy: runDoctor CLI in manifest + found in PATH: cli status = ok
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BooleanLiteral
src/commands/doctor.ts:122:9
   const cliChecks: DoctorCheck[] = []
   for (const opt of CLI_OPTIONS) {
     const bin = await which(opt.id)
-    if (!installedClis.has(opt.id)) {
+    if (installedClis.has(opt.id)) {
       cliChecks.push({ label: opt.id.padEnd(12), status: 'skip', detail: 'not installed via javi-ai' })
     } else if (bin) {
killedBy: runDoctor CLI in manifest + found in PATH: cli status = ok
statusReason: expected 'skip' to be 'ok' // Object.is equality

[Killed] BlockStatement
src/commands/doctor.ts:122:37
   const cliChecks: DoctorCheck[] = []
   for (const opt of CLI_OPTIONS) {
     const bin = await which(opt.id)
-    if (!installedClis.has(opt.id)) {
-      cliChecks.push({ label: opt.id.padEnd(12), status: 'skip', detail: 'not installed via javi-ai' })
-    } else if (bin) {
+    if (!installedClis.has(opt.id)) {} else if (bin) {
       cliChecks.push({ label: opt.id.padEnd(12), status: 'ok', detail: `found at ${bin}` })
     } else {
killedBy: runDoctor CLI not in manifest: cli status = skip
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/commands/doctor.ts:124:21
     const bin = await which(opt.id)
     if (!installedClis.has(opt.id)) {
       cliChecks.push({ label: opt.id.padEnd(12), status: 'skip', detail: 'not installed via javi-ai' })
-    } else if (bin) {
-      cliChecks.push({ label: opt.id.padEnd(12), status: 'ok', detail: `found at ${bin}` })
-    } else {
+    } else if (bin) {} else {
       cliChecks.push({ label: opt.id.padEnd(12), status: 'fail', detail: 'not found in PATH' })
     }
killedBy: runDoctor CLI in manifest + found in PATH: cli status = ok
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
src/commands/doctor.ts:124:16
     const bin = await which(opt.id)
     if (!installedClis.has(opt.id)) {
       cliChecks.push({ label: opt.id.padEnd(12), status: 'skip', detail: 'not installed via javi-ai' })
-    } else if (bin) {
+    } else if (true) {
       cliChecks.push({ label: opt.id.padEnd(12), status: 'ok', detail: `found at ${bin}` })
     } else {
killedBy: runDoctor CLI in manifest + NOT in PATH: cli status = fail
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] StringLiteral
src/commands/doctor.ts:125:72
     if (!installedClis.has(opt.id)) {
       cliChecks.push({ label: opt.id.padEnd(12), status: 'skip', detail: 'not installed via javi-ai' })
     } else if (bin) {
-      cliChecks.push({ label: opt.id.padEnd(12), status: 'ok', detail: `found at ${bin}` })
+      cliChecks.push({ label: opt.id.padEnd(12), status: 'ok', detail: `` })
     } else {
       cliChecks.push({ label: opt.id.padEnd(12), status: 'fail', detail: 'not found in PATH' })
killedBy: runDoctor CLI in manifest + found in PATH: cli status = ok
statusReason: expected '' to contain '/usr/bin/claude'

[Killed] BlockStatement
src/commands/doctor.ts:126:12
       cliChecks.push({ label: opt.id.padEnd(12), status: 'skip', detail: 'not installed via javi-ai' })
     } else if (bin) {
       cliChecks.push({ label: opt.id.padEnd(12), status: 'ok', detail: `found at ${bin}` })
-    } else {
-      cliChecks.push({ label: opt.id.padEnd(12), status: 'fail', detail: 'not found in PATH' })
-    }
+    } else {}
   }
   sections.push({ title: 'CLI Detection', checks: cliChecks })
killedBy: runDoctor CLI in manifest + NOT in PATH: cli status = fail
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/commands/doctor.ts:134:36
 
   // ── 3. Skills ──────────────────────────────────────────────────────────────
   const skillChecks: DoctorCheck[] = []
-  for (const cli of installedClis) {
-    const opt = CLI_OPTIONS.find(c => c.id === cli)
-    if (!opt) continue
-    const present = await countInstalledSkills(opt.skillsPath)
-    const ok = present >= expectedSkills
-    skillChecks.push({
-      label: cli.padEnd(12),
-      status: ok ? 'ok' : 'fail',
-      detail: `${present}/${expectedSkills} skills present`,
-    })
-  }
+  for (const cli of installedClis) {}
   if (skillChecks.length === 0) {
     skillChecks.push({ label: 'No CLIs installed', status: 'skip' })
killedBy: runDoctor skill count matches expected: status ok
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] EqualityOperator
src/commands/doctor.ts:135:39
   // ── 3. Skills ──────────────────────────────────────────────────────────────
   const skillChecks: DoctorCheck[] = []
   for (const cli of installedClis) {
-    const opt = CLI_OPTIONS.find(c => c.id === cli)
+    const opt = CLI_OPTIONS.find(c => c.id !== cli)
     if (!opt) continue
     const present = await countInstalledSkills(opt.skillsPath)
killedBy: runDoctor skill count matches expected: status ok
statusReason: expected 'fail' to be 'ok' // Object.is equality

[Killed] ConditionalExpression
src/commands/doctor.ts:135:39
   // ── 3. Skills ──────────────────────────────────────────────────────────────
   const skillChecks: DoctorCheck[] = []
   for (const cli of installedClis) {
-    const opt = CLI_OPTIONS.find(c => c.id === cli)
+    const opt = CLI_OPTIONS.find(c => true)
     if (!opt) continue
     const present = await countInstalledSkills(opt.skillsPath)
killedBy: runDoctor skill check: opt is found by exact CLI id match
statusReason: expected 'fail' to be 'ok' // Object.is equality

[Killed] ConditionalExpression
src/commands/doctor.ts:138:16
     const opt = CLI_OPTIONS.find(c => c.id === cli)
     if (!opt) continue
     const present = await countInstalledSkills(opt.skillsPath)
-    const ok = present >= expectedSkills
+    const ok = true
     skillChecks.push({
       label: cli.padEnd(12),
killedBy: runDoctor skill count below expected: status fail
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] EqualityOperator
src/commands/doctor.ts:138:16
     const opt = CLI_OPTIONS.find(c => c.id === cli)
     if (!opt) continue
     const present = await countInstalledSkills(opt.skillsPath)
-    const ok = present >= expectedSkills
+    const ok = present < expectedSkills
     skillChecks.push({
       label: cli.padEnd(12),
killedBy: runDoctor skill count matches expected: status ok
statusReason: expected 'fail' to be 'ok' // Object.is equality

[Killed] StringLiteral
src/commands/doctor.ts:142:15
     skillChecks.push({
       label: cli.padEnd(12),
       status: ok ? 'ok' : 'fail',
-      detail: `${present}/${expectedSkills} skills present`,
+      detail: ``,
     })
   }
killedBy: runDoctor skill count below expected: status fail
statusReason: expected '' to contain '1/2'

[Killed] EqualityOperator
src/commands/doctor.ts:145:7
       detail: `${present}/${expectedSkills} skills present`,
     })
   }
-  if (skillChecks.length === 0) {
+  if (skillChecks.length !== 0) {
     skillChecks.push({ label: 'No CLIs installed', status: 'skip' })
   }
killedBy: runDoctor skill count: present === expected - 1 → fail
statusReason: expected '1/4 skills present' to contain '1/2'

[Killed] ConditionalExpression
src/commands/doctor.ts:145:7
       detail: `${present}/${expectedSkills} skills present`,
     })
   }
-  if (skillChecks.length === 0) {
+  if (true) {
     skillChecks.push({ label: 'No CLIs installed', status: 'skip' })
   }
killedBy: runDoctor hooks loop body runs for each hook file (not skipped entirely)
statusReason: expected undefined to be defined
