[Killed] BlockStatement
src/commands/doctor.ts:152:56
 
   // ── 4. Config Files ────────────────────────────────────────────────────────
   const configChecks: DoctorCheck[] = []
-  for (const { cli, label, filePath } of CONFIG_FILES) {
-    if (!installedClis.has(cli)) {
-      configChecks.push({ label, status: 'skip', detail: 'not installed' })
-    } else {
-      const exists = await fs.pathExists(filePath)
-      configChecks.push({ label, status: exists ? 'ok' : 'fail', detail: exists ? 'present' : 'missing' })
-    }
-  }
+  for (const { cli, label, filePath } of CONFIG_FILES) {}
   sections.push({ title: 'Config Files', checks: configChecks })
 
killedBy: runDoctor config file present: section has ok/fail checks (not skip) for installed CLI
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/commands/doctor.ts:153:9
   // ── 4. Config Files ────────────────────────────────────────────────────────
   const configChecks: DoctorCheck[] = []
   for (const { cli, label, filePath } of CONFIG_FILES) {
-    if (!installedClis.has(cli)) {
+    if (installedClis.has(cli)) {
       configChecks.push({ label, status: 'skip', detail: 'not installed' })
     } else {
killedBy: runDoctor config file present: section has ok/fail checks (not skip) for installed CLI
statusReason: expected [ 'ok', 'fail' ] to include 'skip'

[Killed] ConditionalExpression
src/commands/doctor.ts:153:9
   // ── 4. Config Files ────────────────────────────────────────────────────────
   const configChecks: DoctorCheck[] = []
   for (const { cli, label, filePath } of CONFIG_FILES) {
-    if (!installedClis.has(cli)) {
+    if (false) {
       configChecks.push({ label, status: 'skip', detail: 'not installed' })
     } else {
killedBy: runDoctor opencode config shows as skip when opencode not in manifest
statusReason: expected 'ok' to be 'skip' // Object.is equality

[Killed] StringLiteral
src/commands/doctor.ts:154:58
   const configChecks: DoctorCheck[] = []
   for (const { cli, label, filePath } of CONFIG_FILES) {
     if (!installedClis.has(cli)) {
-      configChecks.push({ label, status: 'skip', detail: 'not installed' })
+      configChecks.push({ label, status: 'skip', detail: "" })
     } else {
       const exists = await fs.pathExists(filePath)
killedBy: runDoctor hooks src path uses "own" subdir
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/commands/doctor.ts:155:12
   for (const { cli, label, filePath } of CONFIG_FILES) {
     if (!installedClis.has(cli)) {
       configChecks.push({ label, status: 'skip', detail: 'not installed' })
-    } else {
-      const exists = await fs.pathExists(filePath)
-      configChecks.push({ label, status: exists ? 'ok' : 'fail', detail: exists ? 'present' : 'missing' })
-    }
+    } else {}
   }
   sections.push({ title: 'Config Files', checks: configChecks })
killedBy: runDoctor config file present: section has ok/fail checks (not skip) for installed CLI
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/commands/doctor.ts:157:95
       configChecks.push({ label, status: 'skip', detail: 'not installed' })
     } else {
       const exists = await fs.pathExists(filePath)
-      configChecks.push({ label, status: exists ? 'ok' : 'fail', detail: exists ? 'present' : 'missing' })
+      configChecks.push({ label, status: exists ? 'ok' : 'fail', detail: exists ? 'present' : "" })
     }
   }
killedBy: runDoctor hook detection: installs.has(claude) + missing hooksSrc → skip/no hook checks
statusReason: ENOTEMPTY: directory not empty, rmdir '/tmp/javi-ai-doctor-assets-test/upstream/skills'

[Killed] StringLiteral
src/commands/doctor.ts:164:42
 
   // ── 5. Hooks ───────────────────────────────────────────────────────────────
   const hookChecks: DoctorCheck[] = []
-  const hooksDir = path.join(process.env['HOME'] ?? '~', '.claude', 'hooks')
+  const hooksDir = path.join(process.env[""] ?? '~', '.claude', 'hooks')
   const hooksSrc = path.join(ASSETS_ROOT, 'own', 'hooks', 'claude')
 
killedBy: runDoctor hook check: hook file exists but is not executable → status fail
statusReason: expected 'not found' to contain 'not executable'

[Killed] StringLiteral
src/commands/doctor.ts:164:58
 
   // ── 5. Hooks ───────────────────────────────────────────────────────────────
   const hookChecks: DoctorCheck[] = []
-  const hooksDir = path.join(process.env['HOME'] ?? '~', '.claude', 'hooks')
+  const hooksDir = path.join(process.env['HOME'] ?? '~', "", 'hooks')
   const hooksSrc = path.join(ASSETS_ROOT, 'own', 'hooks', 'claude')
 
killedBy: runDoctor skill count below expected: status fail
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] StringLiteral
src/commands/doctor.ts:165:43
   // ── 5. Hooks ───────────────────────────────────────────────────────────────
   const hookChecks: DoctorCheck[] = []
   const hooksDir = path.join(process.env['HOME'] ?? '~', '.claude', 'hooks')
-  const hooksSrc = path.join(ASSETS_ROOT, 'own', 'hooks', 'claude')
+  const hooksSrc = path.join(ASSETS_ROOT, "", 'hooks', 'claude')
 
   if (installedClis.has('claude') && await fs.pathExists(hooksSrc)) {
killedBy: runDoctor hooks loop body runs for each hook file (not skipped entirely)
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/commands/doctor.ts:167:69
   const hooksDir = path.join(process.env['HOME'] ?? '~', '.claude', 'hooks')
   const hooksSrc = path.join(ASSETS_ROOT, 'own', 'hooks', 'claude')
 
-  if (installedClis.has('claude') && await fs.pathExists(hooksSrc)) {
-    const hookFiles = await fs.readdir(hooksSrc)
-    for (const hookFile of hookFiles) {
-      const hookPath = path.join(hooksDir, hookFile)
-      if (!await fs.pathExists(hookPath)) {
-        hookChecks.push({ label: hookFile, status: 'fail', detail: 'not found' })
-      } else {
-        try {
-          await fs.access(hookPath, fs.constants.X_OK)
-          hookChecks.push({ label: hookFile, status: 'ok', detail: 'executable' })
-        } catch {
-          hookChecks.push({ label: hookFile, status: 'fail', detail: 'not executable' })
-        }
-      }
-    }
-  }
+  if (installedClis.has('claude') && await fs.pathExists(hooksSrc)) {}
   if (hookChecks.length === 0) {
     hookChecks.push({ label: 'No hooks installed', status: 'skip' })
killedBy: runDoctor hooks loop body runs for each hook file (not skipped entirely)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/commands/doctor.ts:167:7
   const hooksDir = path.join(process.env['HOME'] ?? '~', '.claude', 'hooks')
   const hooksSrc = path.join(ASSETS_ROOT, 'own', 'hooks', 'claude')
 
-  if (installedClis.has('claude') && await fs.pathExists(hooksSrc)) {
+  if (true) {
     const hookFiles = await fs.readdir(hooksSrc)
     for (const hookFile of hookFiles) {
killedBy: runDoctor no manifest: installation section shows installed=false
statusReason: ENOENT: no such file or directory, scandir '/tmp/javi-ai-doctor-assets-test/own/hooks/claude'

[Killed] BlockStatement
src/commands/doctor.ts:169:39
 
   if (installedClis.has('claude') && await fs.pathExists(hooksSrc)) {
     const hookFiles = await fs.readdir(hooksSrc)
-    for (const hookFile of hookFiles) {
-      const hookPath = path.join(hooksDir, hookFile)
-      if (!await fs.pathExists(hookPath)) {
-        hookChecks.push({ label: hookFile, status: 'fail', detail: 'not found' })
-      } else {
-        try {
-          await fs.access(hookPath, fs.constants.X_OK)
-          hookChecks.push({ label: hookFile, status: 'ok', detail: 'executable' })
-        } catch {
-          hookChecks.push({ label: hookFile, status: 'fail', detail: 'not executable' })
-        }
-      }
-    }
+    for (const hookFile of hookFiles) {}
   }
   if (hookChecks.length === 0) {
killedBy: runDoctor hooks loop body runs for each hook file (not skipped entirely)
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/commands/doctor.ts:171:43
     const hookFiles = await fs.readdir(hooksSrc)
     for (const hookFile of hookFiles) {
       const hookPath = path.join(hooksDir, hookFile)
-      if (!await fs.pathExists(hookPath)) {
-        hookChecks.push({ label: hookFile, status: 'fail', detail: 'not found' })
-      } else {
+      if (!await fs.pathExists(hookPath)) {} else {
         try {
           await fs.access(hookPath, fs.constants.X_OK)
killedBy: runDoctor hooks loop body runs for each hook file (not skipped entirely)
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/commands/doctor.ts:171:11
     const hookFiles = await fs.readdir(hooksSrc)
     for (const hookFile of hookFiles) {
       const hookPath = path.join(hooksDir, hookFile)
-      if (!await fs.pathExists(hookPath)) {
+      if (await fs.pathExists(hookPath)) {
         hookChecks.push({ label: hookFile, status: 'fail', detail: 'not found' })
       } else {
killedBy: runDoctor hook file absent: status fail (when hooks source exists)
statusReason: expected 'not executable' to contain 'not found'

[Survived] BlockStatement
src/commands/doctor.ts:173:14
       const hookPath = path.join(hooksDir, hookFile)
       if (!await fs.pathExists(hookPath)) {
         hookChecks.push({ label: hookFile, status: 'fail', detail: 'not found' })
-      } else {
-        try {
-          await fs.access(hookPath, fs.constants.X_OK)
-          hookChecks.push({ label: hookFile, status: 'ok', detail: 'executable' })
-        } catch {
-          hookChecks.push({ label: hookFile, status: 'fail', detail: 'not executable' })
-        }
-      }
+      } else {}
     }
   }

[Survived] BlockStatement
src/commands/doctor.ts:174:13
       if (!await fs.pathExists(hookPath)) {
         hookChecks.push({ label: hookFile, status: 'fail', detail: 'not found' })
       } else {
-        try {
-          await fs.access(hookPath, fs.constants.X_OK)
-          hookChecks.push({ label: hookFile, status: 'ok', detail: 'executable' })
-        } catch {
+        try {} catch {
           hookChecks.push({ label: hookFile, status: 'fail', detail: 'not executable' })
         }

[Killed] BlockStatement
src/commands/doctor.ts:177:17
         try {
           await fs.access(hookPath, fs.constants.X_OK)
           hookChecks.push({ label: hookFile, status: 'ok', detail: 'executable' })
-        } catch {
-          hookChecks.push({ label: hookFile, status: 'fail', detail: 'not executable' })
-        }
+        } catch {}
       }
     }
killedBy: runDoctor countExpectedSkills: own skills do not require SKILL.md to be counted
statusReason: expected '1/0 skills present' to contain '1/1'

[Killed] StringLiteral
src/commands/doctor.ts:178:70
           await fs.access(hookPath, fs.constants.X_OK)
           hookChecks.push({ label: hookFile, status: 'ok', detail: 'executable' })
         } catch {
-          hookChecks.push({ label: hookFile, status: 'fail', detail: 'not executable' })
+          hookChecks.push({ label: hookFile, status: 'fail', detail: "" })
         }
       }
killedBy: runDoctor hook check: hook file exists but is not executable → status fail
statusReason: expected '' to contain 'not executable'

[Killed] BlockStatement
src/commands/doctor.ts:183:32
       }
     }
   }
-  if (hookChecks.length === 0) {
-    hookChecks.push({ label: 'No hooks installed', status: 'skip' })
-  }
+  if (hookChecks.length === 0) {}
   sections.push({ title: 'Hooks', checks: hookChecks })
 
killedBy: runDoctor hook detection: installs.has(claude) + missing hooksSrc → skip/no hook checks
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/commands/doctor.ts:183:7
       }
     }
   }
-  if (hookChecks.length === 0) {
+  if (false) {
     hookChecks.push({ label: 'No hooks installed', status: 'skip' })
   }
killedBy: runDoctor hook detection: installs.has(claude) + missing hooksSrc → skip/no hook checks
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/commands/doctor.ts:186:26
   if (hookChecks.length === 0) {
     hookChecks.push({ label: 'No hooks installed', status: 'skip' })
   }
-  sections.push({ title: 'Hooks', checks: hookChecks })
+  sections.push({ title: "", checks: hookChecks })
 
   // ── 6. Backups ─────────────────────────────────────────────────────────────
killedBy: runDoctor hook file absent: status fail (when hooks source exists)
statusReason: ENOTEMPTY: directory not empty, rmdir '/tmp/javi-ai-doctor-assets-test/upstream/skills'

[Killed] BlockStatement
src/commands/doctor.ts:190:40
 
   // ── 6. Backups ─────────────────────────────────────────────────────────────
   const backupChecks: DoctorCheck[] = []
-  if (await fs.pathExists(BACKUP_DIR)) {
-    const backupDirs = (await fs.readdir(BACKUP_DIR)).sort().reverse()
-    if (backupDirs.length === 0) {
-      backupChecks.push({ label: 'No backups found', status: 'skip' })
-    } else {
-      for (const backup of backupDirs.slice(0, 5)) {
-        const backupPath = path.join(BACKUP_DIR, backup)
-        const files = await fs.readdir(backupPath, { recursive: true })
-        const fileCount = (await Promise.all(
-          files.map(async f => {
-            const stat = await fs.stat(path.join(backupPath, String(f)))
-            return stat.isFile() ? 1 : 0
-          })
-        )).reduce((a: number, b: number) => a + b, 0)
-        backupChecks.push({
-          label: backup.replace(/T(\d{2})-(\d{2})-(\d{2})/, 'T$1:$2:$3').slice(0, 19),
-          status: 'ok',
-          detail: `${fileCount} files`,
-        })
-      }
-      if (backupDirs.length > 5) {
-        backupChecks.push({ label: `... and ${backupDirs.length - 5} more`, status: 'skip' })
-      }
-    }
-  } else {
+  if (await fs.pathExists(BACKUP_DIR)) {} else {
     backupChecks.push({ label: 'No backup directory', status: 'skip' })
   }
killedBy: runDoctor skill count below expected: status fail
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] ConditionalExpression
src/commands/doctor.ts:190:7
 
   // ── 6. Backups ─────────────────────────────────────────────────────────────
   const backupChecks: DoctorCheck[] = []
-  if (await fs.pathExists(BACKUP_DIR)) {
+  if (false) {
     const backupDirs = (await fs.readdir(BACKUP_DIR)).sort().reverse()
     if (backupDirs.length === 0) {
killedBy: runDoctor backup dirs listed (up to 5)
statusReason: expected undefined to be defined

[Killed] MethodExpression
src/commands/doctor.ts:191:24
   // ── 6. Backups ─────────────────────────────────────────────────────────────
   const backupChecks: DoctorCheck[] = []
   if (await fs.pathExists(BACKUP_DIR)) {
-    const backupDirs = (await fs.readdir(BACKUP_DIR)).sort().reverse()
+    const backupDirs = (await fs.readdir(BACKUP_DIR)).sort()
     if (backupDirs.length === 0) {
       backupChecks.push({ label: 'No backups found', status: 'skip' })
killedBy: runDoctor backup dirs are sorted newest-first (reverse chronological)
statusReason: expected '2024-01-01T00:00:00' to contain '2024-03'

[Killed] ConditionalExpression
src/commands/doctor.ts:192:9
   const backupChecks: DoctorCheck[] = []
   if (await fs.pathExists(BACKUP_DIR)) {
     const backupDirs = (await fs.readdir(BACKUP_DIR)).sort().reverse()
-    if (backupDirs.length === 0) {
+    if (false) {
       backupChecks.push({ label: 'No backups found', status: 'skip' })
     } else {
killedBy: runDoctor empty backup directory: shows "No backups found" skip check
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/commands/doctor.ts:192:9
   const backupChecks: DoctorCheck[] = []
   if (await fs.pathExists(BACKUP_DIR)) {
     const backupDirs = (await fs.readdir(BACKUP_DIR)).sort().reverse()
-    if (backupDirs.length === 0) {
+    if (true) {
       backupChecks.push({ label: 'No backups found', status: 'skip' })
     } else {
killedBy: runDoctor backup dirs listed (up to 5)
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/commands/doctor.ts:193:34
   if (await fs.pathExists(BACKUP_DIR)) {
     const backupDirs = (await fs.readdir(BACKUP_DIR)).sort().reverse()
     if (backupDirs.length === 0) {
-      backupChecks.push({ label: 'No backups found', status: 'skip' })
+      backupChecks.push({ label: "", status: 'skip' })
     } else {
       for (const backup of backupDirs.slice(0, 5)) {
killedBy: runDoctor empty backup directory: shows "No backups found" skip check
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/commands/doctor.ts:194:12
     const backupDirs = (await fs.readdir(BACKUP_DIR)).sort().reverse()
     if (backupDirs.length === 0) {
       backupChecks.push({ label: 'No backups found', status: 'skip' })
-    } else {
-      for (const backup of backupDirs.slice(0, 5)) {
-        const backupPath = path.join(BACKUP_DIR, backup)
-        const files = await fs.readdir(backupPath, { recursive: true })
-        const fileCount = (await Promise.all(
-          files.map(async f => {
-            const stat = await fs.stat(path.join(backupPath, String(f)))
-            return stat.isFile() ? 1 : 0
-          })
-        )).reduce((a: number, b: number) => a + b, 0)
-        backupChecks.push({
-          label: backup.replace(/T(\d{2})-(\d{2})-(\d{2})/, 'T$1:$2:$3').slice(0, 19),
-          status: 'ok',
-          detail: `${fileCount} files`,
-        })
-      }
-      if (backupDirs.length > 5) {
-        backupChecks.push({ label: `... and ${backupDirs.length - 5} more`, status: 'skip' })
-      }
-    }
+    } else {}
   } else {
     backupChecks.push({ label: 'No backup directory', status: 'skip' })
killedBy: runDoctor backup dirs listed (up to 5)
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/commands/doctor.ts:195:52
     if (backupDirs.length === 0) {
       backupChecks.push({ label: 'No backups found', status: 'skip' })
     } else {
-      for (const backup of backupDirs.slice(0, 5)) {
-        const backupPath = path.join(BACKUP_DIR, backup)
-        const files = await fs.readdir(backupPath, { recursive: true })
-        const fileCount = (await Promise.all(
-          files.map(async f => {
-            const stat = await fs.stat(path.join(backupPath, String(f)))
-            return stat.isFile() ? 1 : 0
-          })
-        )).reduce((a: number, b: number) => a + b, 0)
-        backupChecks.push({
-          label: backup.replace(/T(\d{2})-(\d{2})-(\d{2})/, 'T$1:$2:$3').slice(0, 19),
-          status: 'ok',
-          detail: `${fileCount} files`,
-        })
-      }
+      for (const backup of backupDirs.slice(0, 5)) {}
       if (backupDirs.length > 5) {
         backupChecks.push({ label: `... and ${backupDirs.length - 5} more`, status: 'skip' })
killedBy: runDoctor skill count below expected: status fail
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] MethodExpression
src/commands/doctor.ts:195:28
     if (backupDirs.length === 0) {
       backupChecks.push({ label: 'No backups found', status: 'skip' })
     } else {
-      for (const backup of backupDirs.slice(0, 5)) {
+      for (const backup of backupDirs) {
         const backupPath = path.join(BACKUP_DIR, backup)
         const files = await fs.readdir(backupPath, { recursive: true })
killedBy: runDoctor backup dirs listed (up to 5)
statusReason: expected 7 to be less than or equal to 5

[Killed] BooleanLiteral
src/commands/doctor.ts:197:65
     } else {
       for (const backup of backupDirs.slice(0, 5)) {
         const backupPath = path.join(BACKUP_DIR, backup)
-        const files = await fs.readdir(backupPath, { recursive: true })
+        const files = await fs.readdir(backupPath, { recursive: false })
         const fileCount = (await Promise.all(
           files.map(async f => {
killedBy: runDoctor backup file count is correct (no double-counting) after bug fix
statusReason: expected '3 files' to contain '4 files'

[Killed] ArrowFunction
src/commands/doctor.ts:203:19
             const stat = await fs.stat(path.join(backupPath, String(f)))
             return stat.isFile() ? 1 : 0
           })
-        )).reduce((a: number, b: number) => a + b, 0)
+        )).reduce(() => undefined, 0)
         backupChecks.push({
           label: backup.replace(/T(\d{2})-(\d{2})-(\d{2})/, 'T$1:$2:$3').slice(0, 19),
killedBy: runDoctor backup file count is correct (no double-counting) after bug fix
statusReason: expected 'undefined files' to contain '4 files'

[Survived] ArithmeticOperator
src/commands/doctor.ts:203:45
             const stat = await fs.stat(path.join(backupPath, String(f)))
             return stat.isFile() ? 1 : 0
           })
-        )).reduce((a: number, b: number) => a + b, 0)
+        )).reduce((a: number, b: number) => a - b, 0)
         backupChecks.push({
           label: backup.replace(/T(\d{2})-(\d{2})-(\d{2})/, 'T$1:$2:$3').slice(0, 19),

[Killed] MethodExpression
src/commands/doctor.ts:205:18
           })
         )).reduce((a: number, b: number) => a + b, 0)
         backupChecks.push({
-          label: backup.replace(/T(\d{2})-(\d{2})-(\d{2})/, 'T$1:$2:$3').slice(0, 19),
+          label: backup.replace(/T(\d{2})-(\d{2})-(\d{2})/, 'T$1:$2:$3'),
           status: 'ok',
           detail: `${fileCount} files`,
killedBy: runDoctor countExpectedSkills: upstream dot-dirs and _shared are excluded
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-doctor-assets-test/upstream/skills/react-19/SKILL.md'

[Killed] Regex
src/commands/doctor.ts:205:33
           })
         )).reduce((a: number, b: number) => a + b, 0)
         backupChecks.push({
-          label: backup.replace(/T(\d{2})-(\d{2})-(\d{2})/, 'T$1:$2:$3').slice(0, 19),
+          label: backup.replace(/T(\d{2})-(\d{2})-(\d)/, 'T$1:$2:$3').slice(0, 19),
           status: 'ok',
           detail: `${fileCount} files`,
killedBy: runDoctor backup dirs listed (up to 5)
statusReason: ENOTEMPTY: directory not empty, rmdir '/tmp/javi-ai-doctor-assets-test'

[Killed] StringLiteral
src/commands/doctor.ts:207:19
         backupChecks.push({
           label: backup.replace(/T(\d{2})-(\d{2})-(\d{2})/, 'T$1:$2:$3').slice(0, 19),
           status: 'ok',
-          detail: `${fileCount} files`,
+          detail: ``,
         })
       }
killedBy: runDoctor skill count below expected: status fail
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-doctor-assets-test/upstream/skills/typescript/SKILL.md'

[Killed] EqualityOperator
src/commands/doctor.ts:210:11
           detail: `${fileCount} files`,
         })
       }
-      if (backupDirs.length > 5) {
+      if (backupDirs.length >= 5) {
         backupChecks.push({ label: `... and ${backupDirs.length - 5} more`, status: 'skip' })
       }
killedBy: runDoctor skill count: present === expected - 1 → fail
statusReason: expected '1/3 skills present' to contain '1/2'

[Killed] EqualityOperator
src/commands/doctor.ts:210:11
           detail: `${fileCount} files`,
         })
       }
-      if (backupDirs.length > 5) {
+      if (backupDirs.length <= 5) {
         backupChecks.push({ label: `... and ${backupDirs.length - 5} more`, status: 'skip' })
       }
killedBy: runDoctor skill count matches expected: status ok
statusReason: expected 'fail' to be 'ok' // Object.is equality

[Killed] ArithmeticOperator
src/commands/doctor.ts:211:47
         })
       }
       if (backupDirs.length > 5) {
-        backupChecks.push({ label: `... and ${backupDirs.length - 5} more`, status: 'skip' })
+        backupChecks.push({ label: `... and ${backupDirs.length + 5} more`, status: 'skip' })
       }
     }
killedBy: runDoctor backups: more entry label uses subtraction (length - 5), not addition
statusReason: expected '... and 12 more' not to contain '12 more'

[Killed] BlockStatement
src/commands/doctor.ts:214:10
         backupChecks.push({ label: `... and ${backupDirs.length - 5} more`, status: 'skip' })
       }
     }
-  } else {
-    backupChecks.push({ label: 'No backup directory', status: 'skip' })
-  }
+  } else {}
   sections.push({ title: 'Backups', checks: backupChecks })
 
killedBy: runDoctor backup directory absent: shows skip check
statusReason: expected undefined to be defined
