[Killed] MethodExpression
src/commands/uninstall.ts:152:28
           const startIdx = content.indexOf(MARKER_START)
           const endIdx = content.indexOf(MARKER_END)
           if (startIdx !== -1 && endIdx !== -1) {
-            const before = content.substring(0, startIdx).trimEnd()
+            const before = content.substring(0, startIdx).trimStart()
             const after = content.substring(endIdx + MARKER_END.length).trimStart()
             const result = [before, after].filter(Boolean).join('\n\n')
killedBy: runUninstall buildUninstallPlan: .md files → config-section; .json files → nothing
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/commands/uninstall.ts:153:45
           const endIdx = content.indexOf(MARKER_END)
           if (startIdx !== -1 && endIdx !== -1) {
             const before = content.substring(0, startIdx).trimEnd()
-            const after = content.substring(endIdx + MARKER_END.length).trimStart()
+            const after = content.substring(endIdx - MARKER_END.length).trimStart()
             const result = [before, after].filter(Boolean).join('\n\n')
             if (result.trim()) {
killedBy: runUninstall config-section no backup, has markers: markers and content stripped, surrounding preserved
statusReason: expected '# Header\n\nUser content.\n\n-->\nMan…' not to contain '<!-- END JAVI-AI -->'

[Killed] MethodExpression
src/commands/uninstall.ts:153:27
           const endIdx = content.indexOf(MARKER_END)
           if (startIdx !== -1 && endIdx !== -1) {
             const before = content.substring(0, startIdx).trimEnd()
-            const after = content.substring(endIdx + MARKER_END.length).trimStart()
+            const after = content.trimStart()
             const result = [before, after].filter(Boolean).join('\n\n')
             if (result.trim()) {
killedBy: runUninstall config-section no backup, has markers: markers and content stripped, surrounding preserved
statusReason: expected '# Header\n\nUser content.\n\n# Header…' not to contain '<!-- BEGIN JAVI-AI -->'

[Survived] MethodExpression
src/commands/uninstall.ts:154:28
           if (startIdx !== -1 && endIdx !== -1) {
             const before = content.substring(0, startIdx).trimEnd()
             const after = content.substring(endIdx + MARKER_END.length).trimStart()
-            const result = [before, after].filter(Boolean).join('\n\n')
+            const result = [before, after].join('\n\n')
             if (result.trim()) {
               await fs.writeFile(item.path, result + '\n', 'utf-8')

[Killed] ArrayDeclaration
src/commands/uninstall.ts:154:28
           if (startIdx !== -1 && endIdx !== -1) {
             const before = content.substring(0, startIdx).trimEnd()
             const after = content.substring(endIdx + MARKER_END.length).trimStart()
-            const result = [before, after].filter(Boolean).join('\n\n')
+            const result = [].filter(Boolean).join('\n\n')
             if (result.trim()) {
               await fs.writeFile(item.path, result + '\n', 'utf-8')
killedBy: buildUninstallPlan claude in manifest: includes skills-dir, hooks-dir, config-section items for .md files
statusReason: expected [ 'skills-dir', 'hooks-dir', …(1) ] to include 'config-section'

[Killed] ConditionalExpression
src/commands/uninstall.ts:155:17
             const before = content.substring(0, startIdx).trimEnd()
             const after = content.substring(endIdx + MARKER_END.length).trimStart()
             const result = [before, after].filter(Boolean).join('\n\n')
-            if (result.trim()) {
+            if (false) {
               await fs.writeFile(item.path, result + '\n', 'utf-8')
               removed.push(`${item.label} (section removed)`)
killedBy: runUninstall config-section no backup, has markers: markers and content stripped, surrounding preserved
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-uninstall-fa5f32af-bc47-41da-9ace-4419114f0665/claude-config/CLAUDE.md'

[Killed] BlockStatement
src/commands/uninstall.ts:155:32
             const before = content.substring(0, startIdx).trimEnd()
             const after = content.substring(endIdx + MARKER_END.length).trimStart()
             const result = [before, after].filter(Boolean).join('\n\n')
-            if (result.trim()) {
-              await fs.writeFile(item.path, result + '\n', 'utf-8')
-              removed.push(`${item.label} (section removed)`)
-            } else {
+            if (result.trim()) {} else {
               await fs.remove(item.path)
               removed.push(`${item.label} (file removed — was only javi-ai content)`)
killedBy: runUninstall config-section no backup, has markers: markers and content stripped, surrounding preserved
statusReason: expected '# Header\n\nUser content.\n\n<!-- BEG…' not to contain '<!-- BEGIN JAVI-AI -->'

[Killed] BlockStatement
src/commands/uninstall.ts:158:20
             if (result.trim()) {
               await fs.writeFile(item.path, result + '\n', 'utf-8')
               removed.push(`${item.label} (section removed)`)
-            } else {
-              await fs.remove(item.path)
-              removed.push(`${item.label} (file removed — was only javi-ai content)`)
-            }
+            } else {}
           } else {
             // File doesn't have markers — leave it alone
killedBy: runUninstall config-section no backup, ONLY javi-ai content: file is deleted
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/commands/uninstall.ts:162:18
               await fs.remove(item.path)
               removed.push(`${item.label} (file removed — was only javi-ai content)`)
             }
-          } else {
-            // File doesn't have markers — leave it alone
-            removed.push(`${item.label} (skipped — no javi-ai markers found)`)
-          }
+          } else {}
         }
         continue
killedBy: runUninstall config-section: no markers → file left untouched, item in removed with "skipped"
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/commands/uninstall.ts:169:17
         }
         continue
       }
-    } catch (e) {
-      errors.push(`${item.label}: ${String(e)}`)
-    }
+    } catch (e) {}
   }
 
killedBy: runUninstall error in one item does not abort remaining items
statusReason: expected [] to have a length of 1 but got +0
