[Killed] StringLiteral
src/installer/index.ts:12:45
 import { readManifest, writeManifest } from './manifest.js'
 
 const __dirname = path.dirname(fileURLToPath(import.meta.url))
-const ASSETS_ROOT = path.resolve(__dirname, '../../')
+const ASSETS_ROOT = path.resolve(__dirname, "")
 
 export async function runInstall(
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/installer/index.ts:22:45
   const backupDir = path.join(BACKUP_DIR, timestamp)
 
   for (const cli of options.clis) {
-    const cliOption = CLI_OPTIONS.find(c => c.id === cli)
+    const cliOption = CLI_OPTIONS.find(c => true)
     if (!cliOption) continue
 
killedBy: runInstall — installOrchestrators dest paths opencode orchestrators go to {configPath}/agents (flat)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/installer/index.ts:22:45
   const backupDir = path.join(BACKUP_DIR, timestamp)
 
   for (const cli of options.clis) {
-    const cliOption = CLI_OPTIONS.find(c => c.id === cli)
+    const cliOption = CLI_OPTIONS.find(c => false)
     if (!cliOption) continue
 
killedBy: runInstall — feature routing installs skills when "skills" is in features
statusReason: expected "vi.fn()" to be called with arguments: [ 'claude', false ]

Number of calls: 0

[Killed] BlockStatement
src/installer/index.ts:26:46
     if (!cliOption) continue
 
     // Skills
-    if (options.features.includes('skills')) {
-      onStep({ id: `${cli}-skills`, label: `Installing skills for ${cliOption.label}`, status: 'running' })
-      try {
-        const installed = await installSkillsForCLI(cli, options.dryRun)
-        onStep({ id: `${cli}-skills`, label: `Skills for ${cliOption.label}`, status: 'done', detail: `${installed.length} skills` })
-      } catch (e) {
-        onStep({ id: `${cli}-skills`, label: `Skills for ${cliOption.label}`, status: 'error', detail: String(e) })
-      }
-    }
+    if (options.features.includes('skills')) {}
 
     // Configs
killedBy: runInstall — feature routing installs skills when "skills" is in features
statusReason: expected "vi.fn()" to be called with arguments: [ 'claude', false ]

Number of calls: 0

[Killed] ConditionalExpression
src/installer/index.ts:26:9
     if (!cliOption) continue
 
     // Skills
-    if (options.features.includes('skills')) {
+    if (true) {
       onStep({ id: `${cli}-skills`, label: `Installing skills for ${cliOption.label}`, status: 'running' })
       try {
killedBy: runInstall — feature routing does NOT install skills when "skills" is NOT in features
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "claude",

[Killed] BlockStatement
src/installer/index.ts:28:11
     // Skills
     if (options.features.includes('skills')) {
       onStep({ id: `${cli}-skills`, label: `Installing skills for ${cliOption.label}`, status: 'running' })
-      try {
-        const installed = await installSkillsForCLI(cli, options.dryRun)
-        onStep({ id: `${cli}-skills`, label: `Skills for ${cliOption.label}`, status: 'done', detail: `${installed.length} skills` })
-      } catch (e) {
+      try {} catch (e) {
         onStep({ id: `${cli}-skills`, label: `Skills for ${cliOption.label}`, status: 'error', detail: String(e) })
       }
killedBy: runInstall — feature routing installs skills when "skills" is in features
statusReason: expected "vi.fn()" to be called with arguments: [ 'claude', false ]

Number of calls: 0

[Killed] BlockStatement
src/installer/index.ts:31:19
       try {
         const installed = await installSkillsForCLI(cli, options.dryRun)
         onStep({ id: `${cli}-skills`, label: `Skills for ${cliOption.label}`, status: 'done', detail: `${installed.length} skills` })
-      } catch (e) {
-        onStep({ id: `${cli}-skills`, label: `Skills for ${cliOption.label}`, status: 'error', detail: String(e) })
-      }
+      } catch (e) {}
     }
 
killedBy: runInstall — onStep callbacks skills failure: emits running then error with message
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/installer/index.ts:37:47
     }
 
     // Configs
-    if (options.features.includes('configs')) {
-      onStep({ id: `${cli}-configs`, label: `Installing config for ${cliOption.label}`, status: 'running' })
-      try {
-        await installConfig(cli, cliOption.configPath, backupDir, options.dryRun)
-        onStep({ id: `${cli}-configs`, label: `Config for ${cliOption.label}`, status: 'done' })
-      } catch (e) {
-        onStep({ id: `${cli}-configs`, label: `Config for ${cliOption.label}`, status: 'error', detail: String(e) })
-      }
-    }
+    if (options.features.includes('configs')) {}
 
     // Hooks (claude only for now)
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Survived] ConditionalExpression
src/installer/index.ts:37:9
     }
 
     // Configs
-    if (options.features.includes('configs')) {
+    if (true) {
       onStep({ id: `${cli}-configs`, label: `Installing config for ${cliOption.label}`, status: 'running' })
       try {

[Killed] BlockStatement
src/installer/index.ts:39:11
     // Configs
     if (options.features.includes('configs')) {
       onStep({ id: `${cli}-configs`, label: `Installing config for ${cliOption.label}`, status: 'running' })
-      try {
-        await installConfig(cli, cliOption.configPath, backupDir, options.dryRun)
-        onStep({ id: `${cli}-configs`, label: `Config for ${cliOption.label}`, status: 'done' })
-      } catch (e) {
+      try {} catch (e) {
         onStep({ id: `${cli}-configs`, label: `Config for ${cliOption.label}`, status: 'error', detail: String(e) })
       }
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] StringLiteral
src/installer/index.ts:41:47
       onStep({ id: `${cli}-configs`, label: `Installing config for ${cliOption.label}`, status: 'running' })
       try {
         await installConfig(cli, cliOption.configPath, backupDir, options.dryRun)
-        onStep({ id: `${cli}-configs`, label: `Config for ${cliOption.label}`, status: 'done' })
+        onStep({ id: `${cli}-configs`, label: ``, status: 'done' })
       } catch (e) {
         onStep({ id: `${cli}-configs`, label: `Config for ${cliOption.label}`, status: 'error', detail: String(e) })
killedBy: runInstall — step labels (surviving mutant: label template strings) configs done step has non-empty label
statusReason: expected '' to be truthy

[Killed] BlockStatement
src/installer/index.ts:42:19
       try {
         await installConfig(cli, cliOption.configPath, backupDir, options.dryRun)
         onStep({ id: `${cli}-configs`, label: `Config for ${cliOption.label}`, status: 'done' })
-      } catch (e) {
-        onStep({ id: `${cli}-configs`, label: `Config for ${cliOption.label}`, status: 'error', detail: String(e) })
-      }
+      } catch (e) {}
     }
 
killedBy: runInstall — error isolation if configs throws, hooks still runs (for claude)
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/installer/index.ts:43:22
         await installConfig(cli, cliOption.configPath, backupDir, options.dryRun)
         onStep({ id: `${cli}-configs`, label: `Config for ${cliOption.label}`, status: 'done' })
       } catch (e) {
-        onStep({ id: `${cli}-configs`, label: `Config for ${cliOption.label}`, status: 'error', detail: String(e) })
+        onStep({ id: ``, label: `Config for ${cliOption.label}`, status: 'error', detail: String(e) })
       }
     }
killedBy: runInstall — error isolation if configs throws, hooks still runs (for claude)
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/installer/index.ts:48:47
     }
 
     // Hooks (claude only for now)
-    if (options.features.includes('hooks') && cli === 'claude') {
+    if (options.features.includes('hooks') && cli !== 'claude') {
       onStep({ id: `${cli}-hooks`, label: 'Installing hooks for Claude Code', status: 'running' })
       try {
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/installer/index.ts:48:9
     }
 
     // Hooks (claude only for now)
-    if (options.features.includes('hooks') && cli === 'claude') {
+    if (options.features.includes('hooks') || cli === 'claude') {
       onStep({ id: `${cli}-hooks`, label: 'Installing hooks for Claude Code', status: 'running' })
       try {
killedBy: runInstall — hooks guard (claude only) hooks are NOT installed for opencode
statusReason: expected { id: 'opencode-hooks', …(2) } to be undefined

[Killed] StringLiteral
src/installer/index.ts:49:43
 
     // Hooks (claude only for now)
     if (options.features.includes('hooks') && cli === 'claude') {
-      onStep({ id: `${cli}-hooks`, label: 'Installing hooks for Claude Code', status: 'running' })
+      onStep({ id: `${cli}-hooks`, label: "", status: 'running' })
       try {
         await installHooks(cliOption.configPath, options.dryRun)
killedBy: runInstall — step labels (surviving mutant: label template strings) hooks running step has non-empty label
statusReason: expected '' to be truthy

[Killed] BlockStatement
src/installer/index.ts:50:11
     // Hooks (claude only for now)
     if (options.features.includes('hooks') && cli === 'claude') {
       onStep({ id: `${cli}-hooks`, label: 'Installing hooks for Claude Code', status: 'running' })
-      try {
-        await installHooks(cliOption.configPath, options.dryRun)
-        onStep({ id: `${cli}-hooks`, label: 'Hooks for Claude Code', status: 'done' })
-      } catch (e) {
+      try {} catch (e) {
         onStep({ id: `${cli}-hooks`, label: 'Hooks for Claude Code', status: 'error', detail: String(e) })
       }
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/installer/index.ts:53:19
       try {
         await installHooks(cliOption.configPath, options.dryRun)
         onStep({ id: `${cli}-hooks`, label: 'Hooks for Claude Code', status: 'done' })
-      } catch (e) {
-        onStep({ id: `${cli}-hooks`, label: 'Hooks for Claude Code', status: 'error', detail: String(e) })
-      }
+      } catch (e) {}
     }
 

[Killed] ConditionalExpression
src/installer/index.ts:59:9
     }
 
     // Orchestrators
-    if (options.features.includes('orchestrators')) {
+    if (true) {
       onStep({ id: `${cli}-orch`, label: `Installing orchestrators for ${cliOption.label}`, status: 'running' })
       try {
killedBy: runInstall — feature routing does NOT install orchestrators when "orchestrators" not in features
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/installer/index.ts:59:53
     }
 
     // Orchestrators
-    if (options.features.includes('orchestrators')) {
-      onStep({ id: `${cli}-orch`, label: `Installing orchestrators for ${cliOption.label}`, status: 'running' })
-      try {
-        await installOrchestrators(cli, cliOption.configPath, options.dryRun)
-        onStep({ id: `${cli}-orch`, label: `Orchestrators for ${cliOption.label}`, status: 'done' })
-      } catch (e) {
-        onStep({ id: `${cli}-orch`, label: `Orchestrators for ${cliOption.label}`, status: 'error', detail: String(e) })
-      }
-    }
+    if (options.features.includes('orchestrators')) {}
   }
 
killedBy: runInstall — feature routing installs orchestrators when "orchestrators" is in features
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/installer/index.ts:60:20
 
     // Orchestrators
     if (options.features.includes('orchestrators')) {
-      onStep({ id: `${cli}-orch`, label: `Installing orchestrators for ${cliOption.label}`, status: 'running' })
+      onStep({ id: ``, label: `Installing orchestrators for ${cliOption.label}`, status: 'running' })
       try {
         await installOrchestrators(cli, cliOption.configPath, options.dryRun)
killedBy: runInstall — onStep callbacks orchestrators success: emits running then done
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/installer/index.ts:61:11
     // Orchestrators
     if (options.features.includes('orchestrators')) {
       onStep({ id: `${cli}-orch`, label: `Installing orchestrators for ${cliOption.label}`, status: 'running' })
-      try {
-        await installOrchestrators(cli, cliOption.configPath, options.dryRun)
-        onStep({ id: `${cli}-orch`, label: `Orchestrators for ${cliOption.label}`, status: 'done' })
-      } catch (e) {
+      try {} catch (e) {
         onStep({ id: `${cli}-orch`, label: `Orchestrators for ${cliOption.label}`, status: 'error', detail: String(e) })
       }
killedBy: runInstall — feature routing installs orchestrators when "orchestrators" is in features
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/installer/index.ts:63:22
       onStep({ id: `${cli}-orch`, label: `Installing orchestrators for ${cliOption.label}`, status: 'running' })
       try {
         await installOrchestrators(cli, cliOption.configPath, options.dryRun)
-        onStep({ id: `${cli}-orch`, label: `Orchestrators for ${cliOption.label}`, status: 'done' })
+        onStep({ id: ``, label: `Orchestrators for ${cliOption.label}`, status: 'done' })
       } catch (e) {
         onStep({ id: `${cli}-orch`, label: `Orchestrators for ${cliOption.label}`, status: 'error', detail: String(e) })
killedBy: runInstall — onStep callbacks orchestrators success: emits running then done
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/installer/index.ts:64:19
       try {
         await installOrchestrators(cli, cliOption.configPath, options.dryRun)
         onStep({ id: `${cli}-orch`, label: `Orchestrators for ${cliOption.label}`, status: 'done' })
-      } catch (e) {
-        onStep({ id: `${cli}-orch`, label: `Orchestrators for ${cliOption.label}`, status: 'error', detail: String(e) })
-      }
+      } catch (e) {}
     }
   }
killedBy: runInstall — onStep callbacks orchestrators failure: emits running then error
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/installer/index.ts:71:7
   }
 
   // Update manifest
-  if (!options.dryRun) {
+  if (options.dryRun) {
     const manifest = await readManifest()
     manifest.updatedAt = new Date().toISOString()
killedBy: runInstall — manifest update manifest is updated (NOT dryRun)
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/installer/index.ts:71:7
   }
 
   // Update manifest
-  if (!options.dryRun) {
+  if (false) {
     const manifest = await readManifest()
     manifest.updatedAt = new Date().toISOString()
killedBy: runInstall — manifest update manifest is updated (NOT dryRun)
statusReason: expected "vi.fn()" to be called at least once

[Killed] ArrayDeclaration
src/installer/index.ts:74:33
   if (!options.dryRun) {
     const manifest = await readManifest()
     manifest.updatedAt = new Date().toISOString()
-    manifest.clis = [...new Set([...manifest.clis, ...options.clis])]
+    manifest.clis = [...new Set([])]
     await writeManifest(manifest)
   }
killedBy: runInstall — manifest update manifest is updated (NOT dryRun)
statusReason: expected [] to include 'claude'

[Killed] StringLiteral
src/installer/index.ts:80:44
 }
 
 async function installConfig(cli: CLI, configPath: string, backupDir: string, dryRun: boolean): Promise<void> {
-  const configSrc = path.join(ASSETS_ROOT, 'configs', cli)
+  const configSrc = path.join(ASSETS_ROOT, "", cli)
   if (!await fs.pathExists(configSrc)) return
 
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/installer/index.ts:81:7
 
 async function installConfig(cli: CLI, configPath: string, backupDir: string, dryRun: boolean): Promise<void> {
   const configSrc = path.join(ASSETS_ROOT, 'configs', cli)
-  if (!await fs.pathExists(configSrc)) return
+  if (false) return
 
   if (!dryRun) {
killedBy: runInstall — onStep callbacks configs success: emits running then done
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/installer/index.ts:81:7
 
 async function installConfig(cli: CLI, configPath: string, backupDir: string, dryRun: boolean): Promise<void> {
   const configSrc = path.join(ASSETS_ROOT, 'configs', cli)
-  if (!await fs.pathExists(configSrc)) return
+  if (await fs.pathExists(configSrc)) return
 
   if (!dryRun) {
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/installer/index.ts:83:7
   const configSrc = path.join(ASSETS_ROOT, 'configs', cli)
   if (!await fs.pathExists(configSrc)) return
 
-  if (!dryRun) {
+  if (true) {
     await fs.ensureDir(configPath)
     await fs.ensureDir(backupDir)
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Survived] BlockStatement
src/installer/index.ts:83:16
   const configSrc = path.join(ASSETS_ROOT, 'configs', cli)
   if (!await fs.pathExists(configSrc)) return
 
-  if (!dryRun) {
-    await fs.ensureDir(configPath)
-    await fs.ensureDir(backupDir)
-  }
+  if (!dryRun) {}
 
   const files = await fs.readdir(configSrc, { recursive: true }) as string[]

[Killed] BlockStatement
src/installer/index.ts:89:29
   }
 
   const files = await fs.readdir(configSrc, { recursive: true }) as string[]
-  for (const file of files) {
-    const src = path.join(configSrc, file)
-    const stat = await fs.stat(src)
-    if (stat.isDirectory()) continue
-
-    const dest = path.join(configPath, file)
-    const backup = path.join(backupDir, cli, file)
-
-    if (dryRun) continue
-
-    await fs.ensureDir(path.dirname(dest))
-
-    if (file.endsWith('.json')) {
-      await mergeJsonFile(dest, src, await fs.pathExists(dest) ? backup : undefined)
-    } else if (file.endsWith('.md') && file !== 'README.md') {
-      await mergeMarkdownFile(dest, src, await fs.pathExists(dest) ? backup : undefined)
-    } else {
-      // create-if-absent for other files
-      if (!await fs.pathExists(dest)) {
-        await fs.copy(src, dest)
-      }
-    }
-  }
+  for (const file of files) {}
 }
 
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/installer/index.ts:92:9
   for (const file of files) {
     const src = path.join(configSrc, file)
     const stat = await fs.stat(src)
-    if (stat.isDirectory()) continue
+    if (true) continue
 
     const dest = path.join(configPath, file)
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Survived] ConditionalExpression
src/installer/index.ts:92:9
   for (const file of files) {
     const src = path.join(configSrc, file)
     const stat = await fs.stat(src)
-    if (stat.isDirectory()) continue
+    if (false) continue
 
     const dest = path.join(configPath, file)

[Killed] ConditionalExpression
src/installer/index.ts:97:9
     const dest = path.join(configPath, file)
     const backup = path.join(backupDir, cli, file)
 
-    if (dryRun) continue
+    if (true) continue
 
     await fs.ensureDir(path.dirname(dest))
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/installer/index.ts:97:9
     const dest = path.join(configPath, file)
     const backup = path.join(backupDir, cli, file)
 
-    if (dryRun) continue
+    if (false) continue
 
     await fs.ensureDir(path.dirname(dest))
killedBy: runInstall — installConfig file dispatch dryRun=true: no files are written
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "/tmp/javi-ai-idx-15040fea-bd81-4c12-a05d-ea1049ec4658/claude-config/CLAUDE.md",

[Killed] ConditionalExpression
src/installer/index.ts:101:9
 
     await fs.ensureDir(path.dirname(dest))
 
-    if (file.endsWith('.json')) {
+    if (false) {
       await mergeJsonFile(dest, src, await fs.pathExists(dest) ? backup : undefined)
     } else if (file.endsWith('.md') && file !== 'README.md') {
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/installer/index.ts:101:33
 
     await fs.ensureDir(path.dirname(dest))
 
-    if (file.endsWith('.json')) {
-      await mergeJsonFile(dest, src, await fs.pathExists(dest) ? backup : undefined)
-    } else if (file.endsWith('.md') && file !== 'README.md') {
+    if (file.endsWith('.json')) {} else if (file.endsWith('.md') && file !== 'README.md') {
       await mergeMarkdownFile(dest, src, await fs.pathExists(dest) ? backup : undefined)
     } else {
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/installer/index.ts:103:16
 
     if (file.endsWith('.json')) {
       await mergeJsonFile(dest, src, await fs.pathExists(dest) ? backup : undefined)
-    } else if (file.endsWith('.md') && file !== 'README.md') {
+    } else if (false) {
       await mergeMarkdownFile(dest, src, await fs.pathExists(dest) ? backup : undefined)
     } else {
killedBy: runInstall — installConfig file dispatch .md files (not README.md) → mergeMarkdownFile
statusReason: expected "vi.fn()" to be called at least once

[Killed] EqualityOperator
src/installer/index.ts:103:40
 
     if (file.endsWith('.json')) {
       await mergeJsonFile(dest, src, await fs.pathExists(dest) ? backup : undefined)
-    } else if (file.endsWith('.md') && file !== 'README.md') {
+    } else if (file.endsWith('.md') && file === 'README.md') {
       await mergeMarkdownFile(dest, src, await fs.pathExists(dest) ? backup : undefined)
     } else {
killedBy: runInstall — installConfig file dispatch .md files (not README.md) → mergeMarkdownFile
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/installer/index.ts:105:12
       await mergeJsonFile(dest, src, await fs.pathExists(dest) ? backup : undefined)
     } else if (file.endsWith('.md') && file !== 'README.md') {
       await mergeMarkdownFile(dest, src, await fs.pathExists(dest) ? backup : undefined)
-    } else {
-      // create-if-absent for other files
-      if (!await fs.pathExists(dest)) {
-        await fs.copy(src, dest)
-      }
-    }
+    } else {}
   }
 }
killedBy: runInstall — installConfig file dispatch README.md → copy-if-absent (not mergeMarkdown)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/installer/index.ts:107:11
       await mergeMarkdownFile(dest, src, await fs.pathExists(dest) ? backup : undefined)
     } else {
       // create-if-absent for other files
-      if (!await fs.pathExists(dest)) {
+      if (false) {
         await fs.copy(src, dest)
       }
killedBy: runInstall — installConfig file dispatch README.md → copy-if-absent (not mergeMarkdown)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/installer/index.ts:107:39
       await mergeMarkdownFile(dest, src, await fs.pathExists(dest) ? backup : undefined)
     } else {
       // create-if-absent for other files
-      if (!await fs.pathExists(dest)) {
-        await fs.copy(src, dest)
-      }
+      if (!await fs.pathExists(dest)) {}
     }
   }
killedBy: runInstall — installConfig file dispatch README.md → copy-if-absent (not mergeMarkdown)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/installer/index.ts:114:81
   }
 }
 
-async function installHooks(configPath: string, dryRun: boolean): Promise<void> {
-  const hooksSrc = path.join(ASSETS_ROOT, 'own', 'hooks', 'claude')
-  const hooksDest = path.join(configPath, 'hooks')
-  if (!await fs.pathExists(hooksSrc)) return
-  if (dryRun) return
-  await fs.ensureDir(hooksDest)
-  const files = await fs.readdir(hooksSrc)
-  for (const file of files) {
-    const dest = path.join(hooksDest, file)
-    if (!await fs.pathExists(dest)) {
-      await fs.copy(path.join(hooksSrc, file), dest)
-      await fs.chmod(dest, 0o755)
-    }
-  }
-}
+async function installHooks(configPath: string, dryRun: boolean): Promise<void> {}
 
 async function installOrchestrators(cli: CLI, configPath: string, dryRun: boolean): Promise<void> {
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] StringLiteral
src/installer/index.ts:115:43
 }
 
 async function installHooks(configPath: string, dryRun: boolean): Promise<void> {
-  const hooksSrc = path.join(ASSETS_ROOT, 'own', 'hooks', 'claude')
+  const hooksSrc = path.join(ASSETS_ROOT, "", 'hooks', 'claude')
   const hooksDest = path.join(configPath, 'hooks')
   if (!await fs.pathExists(hooksSrc)) return
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/installer/index.ts:116:43
 
 async function installHooks(configPath: string, dryRun: boolean): Promise<void> {
   const hooksSrc = path.join(ASSETS_ROOT, 'own', 'hooks', 'claude')
-  const hooksDest = path.join(configPath, 'hooks')
+  const hooksDest = path.join(configPath, "")
   if (!await fs.pathExists(hooksSrc)) return
   if (dryRun) return
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/installer/index.ts:117:7
 async function installHooks(configPath: string, dryRun: boolean): Promise<void> {
   const hooksSrc = path.join(ASSETS_ROOT, 'own', 'hooks', 'claude')
   const hooksDest = path.join(configPath, 'hooks')
-  if (!await fs.pathExists(hooksSrc)) return
+  if (await fs.pathExists(hooksSrc)) return
   if (dryRun) return
   await fs.ensureDir(hooksDest)
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/installer/index.ts:117:7
 async function installHooks(configPath: string, dryRun: boolean): Promise<void> {
   const hooksSrc = path.join(ASSETS_ROOT, 'own', 'hooks', 'claude')
   const hooksDest = path.join(configPath, 'hooks')
-  if (!await fs.pathExists(hooksSrc)) return
+  if (false) return
   if (dryRun) return
   await fs.ensureDir(hooksDest)
killedBy: runInstall — installHooks create-if-absent hooks source does not exist: no hook files created
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/installer/index.ts:118:7
   const hooksSrc = path.join(ASSETS_ROOT, 'own', 'hooks', 'claude')
   const hooksDest = path.join(configPath, 'hooks')
   if (!await fs.pathExists(hooksSrc)) return
-  if (dryRun) return
+  if (true) return
   await fs.ensureDir(hooksDest)
   const files = await fs.readdir(hooksSrc)
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/installer/index.ts:118:7
   const hooksSrc = path.join(ASSETS_ROOT, 'own', 'hooks', 'claude')
   const hooksDest = path.join(configPath, 'hooks')
   if (!await fs.pathExists(hooksSrc)) return
-  if (dryRun) return
+  if (false) return
   await fs.ensureDir(hooksDest)
   const files = await fs.readdir(hooksSrc)
killedBy: runInstall — installConfig file dispatch backupPath is undefined in mergeJsonFile when dest does NOT exist
statusReason: Cannot read properties of undefined (reading '2')

[Killed] BlockStatement
src/installer/index.ts:121:29
   if (dryRun) return
   await fs.ensureDir(hooksDest)
   const files = await fs.readdir(hooksSrc)
-  for (const file of files) {
-    const dest = path.join(hooksDest, file)
-    if (!await fs.pathExists(dest)) {
-      await fs.copy(path.join(hooksSrc, file), dest)
-      await fs.chmod(dest, 0o755)
-    }
-  }
+  for (const file of files) {}
 }
 
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/installer/index.ts:123:9
   const files = await fs.readdir(hooksSrc)
   for (const file of files) {
     const dest = path.join(hooksDest, file)
-    if (!await fs.pathExists(dest)) {
+    if (true) {
       await fs.copy(path.join(hooksSrc, file), dest)
       await fs.chmod(dest, 0o755)
killedBy: runInstall — installConfig file dispatch .json files → mergeJsonFile
statusReason: ENOTEMPTY: directory not empty, rmdir '/tmp/javi-ai-installer-index-assets-test'
