[Killed] ConditionalExpression
src/installer/index.ts:123:9
   const files = await fs.readdir(hooksSrc)
   for (const file of files) {
     const dest = path.join(hooksDest, file)
-    if (!await fs.pathExists(dest)) {
+    if (false) {
       await fs.copy(path.join(hooksSrc, file), dest)
       await fs.chmod(dest, 0o755)
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/installer/index.ts:130:99
   }
 }
 
-async function installOrchestrators(cli: CLI, configPath: string, dryRun: boolean): Promise<void> {
-  const orchSrc = path.join(ASSETS_ROOT, 'delta', 'orchestrators', cli)
-  if (!await fs.pathExists(orchSrc)) return
-  if (dryRun) return
-  const agentsDest = cli === 'opencode'
-    ? path.join(configPath, 'agents')
-    : path.join(configPath, 'agents', cli)
-  await fs.ensureDir(agentsDest)
-  await fs.copy(orchSrc, agentsDest, { overwrite: true })
-}
+async function installOrchestrators(cli: CLI, configPath: string, dryRun: boolean): Promise<void> {}
 
killedBy: runInstall — feature routing installs orchestrators when "orchestrators" is in features
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/installer/index.ts:132:7
 
 async function installOrchestrators(cli: CLI, configPath: string, dryRun: boolean): Promise<void> {
   const orchSrc = path.join(ASSETS_ROOT, 'delta', 'orchestrators', cli)
-  if (!await fs.pathExists(orchSrc)) return
+  if (false) return
   if (dryRun) return
   const agentsDest = cli === 'opencode'
killedBy: runInstall — installConfig file dispatch README.md → copy-if-absent (not mergeMarkdown)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/installer/index.ts:132:7
 
 async function installOrchestrators(cli: CLI, configPath: string, dryRun: boolean): Promise<void> {
   const orchSrc = path.join(ASSETS_ROOT, 'delta', 'orchestrators', cli)
-  if (!await fs.pathExists(orchSrc)) return
+  if (await fs.pathExists(orchSrc)) return
   if (dryRun) return
   const agentsDest = cli === 'opencode'
killedBy: runInstall — feature routing installs orchestrators when "orchestrators" is in features
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/installer/index.ts:133:7
 async function installOrchestrators(cli: CLI, configPath: string, dryRun: boolean): Promise<void> {
   const orchSrc = path.join(ASSETS_ROOT, 'delta', 'orchestrators', cli)
   if (!await fs.pathExists(orchSrc)) return
-  if (dryRun) return
+  if (false) return
   const agentsDest = cli === 'opencode'
     ? path.join(configPath, 'agents')
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/installer/index.ts:133:7
 async function installOrchestrators(cli: CLI, configPath: string, dryRun: boolean): Promise<void> {
   const orchSrc = path.join(ASSETS_ROOT, 'delta', 'orchestrators', cli)
   if (!await fs.pathExists(orchSrc)) return
-  if (dryRun) return
+  if (true) return
   const agentsDest = cli === 'opencode'
     ? path.join(configPath, 'agents')
killedBy: runInstall — feature routing installs orchestrators when "orchestrators" is in features
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/installer/index.ts:134:22
   const orchSrc = path.join(ASSETS_ROOT, 'delta', 'orchestrators', cli)
   if (!await fs.pathExists(orchSrc)) return
   if (dryRun) return
-  const agentsDest = cli === 'opencode'
+  const agentsDest = false
     ? path.join(configPath, 'agents')
     : path.join(configPath, 'agents', cli)
killedBy: runInstall — installOrchestrators dest paths opencode orchestrators go to {configPath}/agents (flat)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/installer/index.ts:134:22
   const orchSrc = path.join(ASSETS_ROOT, 'delta', 'orchestrators', cli)
   if (!await fs.pathExists(orchSrc)) return
   if (dryRun) return
-  const agentsDest = cli === 'opencode'
+  const agentsDest = true
     ? path.join(configPath, 'agents')
     : path.join(configPath, 'agents', cli)
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] StringLiteral
src/installer/index.ts:136:29
   if (dryRun) return
   const agentsDest = cli === 'opencode'
     ? path.join(configPath, 'agents')
-    : path.join(configPath, 'agents', cli)
+    : path.join(configPath, "", cli)
   await fs.ensureDir(agentsDest)
   await fs.copy(orchSrc, agentsDest, { overwrite: true })
killedBy: runInstall — feature routing installs orchestrators when "orchestrators" is in features
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/installer/index.ts:138:51
     ? path.join(configPath, 'agents')
     : path.join(configPath, 'agents', cli)
   await fs.ensureDir(agentsDest)
-  await fs.copy(orchSrc, agentsDest, { overwrite: true })
+  await fs.copy(orchSrc, agentsDest, { overwrite: false })
 }
 
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality
