[Killed] ConditionalExpression
src/merger/json.ts:12:7
     const sv = source[key]
     const tv = target[key]
     if (
-      sv !== null &&
-      typeof sv === 'object' &&
-      !Array.isArray(sv) &&
-      tv !== null &&
-      typeof tv === 'object' &&
+      true &&
       !Array.isArray(tv)
     ) {
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/merger/json.ts:12:7
     const sv = source[key]
     const tv = target[key]
     if (
-      sv !== null &&
-      typeof sv === 'object' &&
-      !Array.isArray(sv) &&
-      tv !== null &&
+      true &&
       typeof tv === 'object' &&
       !Array.isArray(tv)
killedBy: runInstall — installConfig file dispatch dryRun=true: no files are written
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-installer-index-assets-test/configs/claude/CLAUDE.md'

[Killed] ConditionalExpression
src/merger/json.ts:13:7
     const tv = target[key]
     if (
       sv !== null &&
-      typeof sv === 'object' &&
+      true &&
       !Array.isArray(sv) &&
       tv !== null &&
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/merger/json.ts:15:7
       sv !== null &&
       typeof sv === 'object' &&
       !Array.isArray(sv) &&
-      tv !== null &&
+      true &&
       typeof tv === 'object' &&
       !Array.isArray(tv)
killedBy: runInstall — step labels (surviving mutant: label template strings) orchestrators done step has non-empty label
statusReason: expected undefined to be truthy

[Survived] ConditionalExpression
src/merger/json.ts:16:7
       typeof sv === 'object' &&
       !Array.isArray(sv) &&
       tv !== null &&
-      typeof tv === 'object' &&
+      true &&
       !Array.isArray(tv)
     ) {

[Killed] BlockStatement
src/merger/json.ts:18:7
       tv !== null &&
       typeof tv === 'object' &&
       !Array.isArray(tv)
-    ) {
-      result[key] = deepMerge(tv as JsonObject, sv as JsonObject)
-    } else if (Array.isArray(sv) && Array.isArray(tv)) {
+    ) {} else if (Array.isArray(sv) && Array.isArray(tv)) {
       // deduplicate by JSON value
       const merged = [...tv]
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/merger/json.ts:20:56
       !Array.isArray(tv)
     ) {
       result[key] = deepMerge(tv as JsonObject, sv as JsonObject)
-    } else if (Array.isArray(sv) && Array.isArray(tv)) {
-      // deduplicate by JSON value
-      const merged = [...tv]
-      for (const item of sv) {
-        const itemStr = JSON.stringify(item)
-        if (!merged.some(m => JSON.stringify(m) === itemStr)) {
-          merged.push(item)
-        }
-      }
-      result[key] = merged
-    } else {
+    } else if (Array.isArray(sv) && Array.isArray(tv)) {} else {
       result[key] = sv
     }
killedBy: runInstall — installConfig file dispatch backupPath is undefined in mergeJsonFile when dest does NOT exist
statusReason: Cannot read properties of undefined (reading '2')

[Killed] BlockStatement
src/merger/json.ts:23:30
     } else if (Array.isArray(sv) && Array.isArray(tv)) {
       // deduplicate by JSON value
       const merged = [...tv]
-      for (const item of sv) {
-        const itemStr = JSON.stringify(item)
-        if (!merged.some(m => JSON.stringify(m) === itemStr)) {
-          merged.push(item)
-        }
-      }
+      for (const item of sv) {}
       result[key] = merged
     } else {
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/merger/json.ts:25:13
       const merged = [...tv]
       for (const item of sv) {
         const itemStr = JSON.stringify(item)
-        if (!merged.some(m => JSON.stringify(m) === itemStr)) {
+        if (merged.some(m => JSON.stringify(m) === itemStr)) {
           merged.push(item)
         }
killedBy: runInstall — step labels (surviving mutant: label template strings) orchestrators: copy uses overwrite:true (file gets updated on reinstall)
statusReason: expected '# Old Agent' to be '# New Agent' // Object.is equality

[Killed] MethodExpression
src/merger/json.ts:25:14
       const merged = [...tv]
       for (const item of sv) {
         const itemStr = JSON.stringify(item)
-        if (!merged.some(m => JSON.stringify(m) === itemStr)) {
+        if (!merged.every(m => JSON.stringify(m) === itemStr)) {
           merged.push(item)
         }
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/merger/json.ts:30:12
         }
       }
       result[key] = merged
-    } else {
-      result[key] = sv
-    }
+    } else {}
   }
   return result
killedBy: runInstall — step labels (surviving mutant: label template strings) configs error step has non-empty label
statusReason: expected undefined to be truthy

[Killed] BlockStatement
src/merger/json.ts:41:18
   targetPath: string,
   sourcePath: string,
   backupPath?: string
-): Promise<void> {
-  const sourceContent = await fs.readFile(sourcePath, 'utf-8')
-  const source = JSON.parse(sourceContent) as JsonObject
-
-  if (await fs.pathExists(targetPath)) {
-    if (backupPath) {
-      await fs.copy(targetPath, backupPath)
-    }
-    const targetContent = await fs.readFile(targetPath, 'utf-8')
-    const target = JSON.parse(targetContent) as JsonObject
-    const merged = deepMerge(target, source)
-    await fs.writeFile(targetPath, JSON.stringify(merged, null, 2), 'utf-8')
-  } else {
-    await fs.ensureDir(targetPath.substring(0, targetPath.lastIndexOf('/')))
-    await fs.copy(sourcePath, targetPath)
-  }
-}
+): Promise<void> {}
 
killedBy: deepMerge (via mergeJsonFile) merges disjoint keys from both objects
statusReason: expected { a: 1 } to deeply equal { a: 1, b: 2 }

[Killed] ConditionalExpression
src/merger/json.ts:45:7
   const sourceContent = await fs.readFile(sourcePath, 'utf-8')
   const source = JSON.parse(sourceContent) as JsonObject
 
-  if (await fs.pathExists(targetPath)) {
+  if (true) {
     if (backupPath) {
       await fs.copy(targetPath, backupPath)
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/merger/json.ts:45:40
   const sourceContent = await fs.readFile(sourcePath, 'utf-8')
   const source = JSON.parse(sourceContent) as JsonObject
 
-  if (await fs.pathExists(targetPath)) {
-    if (backupPath) {
-      await fs.copy(targetPath, backupPath)
-    }
-    const targetContent = await fs.readFile(targetPath, 'utf-8')
-    const target = JSON.parse(targetContent) as JsonObject
-    const merged = deepMerge(target, source)
-    await fs.writeFile(targetPath, JSON.stringify(merged, null, 2), 'utf-8')
-  } else {
+  if (await fs.pathExists(targetPath)) {} else {
     await fs.ensureDir(targetPath.substring(0, targetPath.lastIndexOf('/')))
     await fs.copy(sourcePath, targetPath)
killedBy: deepMerge (via mergeJsonFile) merges disjoint keys from both objects
statusReason: expected { a: 1 } to deeply equal { a: 1, b: 2 }

[Killed] BlockStatement
src/merger/json.ts:46:21
   const source = JSON.parse(sourceContent) as JsonObject
 
   if (await fs.pathExists(targetPath)) {
-    if (backupPath) {
-      await fs.copy(targetPath, backupPath)
-    }
+    if (backupPath) {}
     const targetContent = await fs.readFile(targetPath, 'utf-8')
     const target = JSON.parse(targetContent) as JsonObject
killedBy: mergeJsonFile (integration) target present, backup requested: backup created before merge, merge correct
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-test-2bdb6165-a32f-416b-8a92-e0138a86be34/backup.json'

[Killed] BlockStatement
src/merger/json.ts:53:10
     const target = JSON.parse(targetContent) as JsonObject
     const merged = deepMerge(target, source)
     await fs.writeFile(targetPath, JSON.stringify(merged, null, 2), 'utf-8')
-  } else {
-    await fs.ensureDir(targetPath.substring(0, targetPath.lastIndexOf('/')))
-    await fs.copy(sourcePath, targetPath)
-  }
+  } else {}
 }
 
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/merger/json.ts:54:24
     const merged = deepMerge(target, source)
     await fs.writeFile(targetPath, JSON.stringify(merged, null, 2), 'utf-8')
   } else {
-    await fs.ensureDir(targetPath.substring(0, targetPath.lastIndexOf('/')))
+    await fs.ensureDir(targetPath)
     await fs.copy(sourcePath, targetPath)
   }
killedBy: mergeJsonFile (integration) target absent: copies source as-is
statusReason: Cannot overwrite directory '/tmp/javi-ai-test-ed93e9d8-4446-4067-8f0e-7f9f326c9aeb/target.json' with non-directory '/tmp/javi-ai-test-ed93e9d8-4446-4067-8f0e-7f9f326c9aeb/source.json'.
