[Killed] ConditionalExpression
src/installer/skills.ts:13:43
 // Priority order: psf (lowest) → upstream → own → delta-extensions (highest)
 // Skills in upstream/ with EXTENSION.md get the extension appended
 async function installSkillsForCLI(cli: CLI, dryRun: boolean): Promise<string[]> {
-  const cliOption = CLI_OPTIONS.find(c => c.id === cli)
+  const cliOption = CLI_OPTIONS.find(c => false)
   if (!cliOption) return []
 
killedBy: installSkillsForCLI dryRun: returns correct skill names without creating files
statusReason: expected [] to include 'react-19'

[Killed] ArrowFunction
src/installer/skills.ts:13:38
 // Priority order: psf (lowest) → upstream → own → delta-extensions (highest)
 // Skills in upstream/ with EXTENSION.md get the extension appended
 async function installSkillsForCLI(cli: CLI, dryRun: boolean): Promise<string[]> {
-  const cliOption = CLI_OPTIONS.find(c => c.id === cli)
+  const cliOption = CLI_OPTIONS.find(() => undefined)
   if (!cliOption) return []
 
killedBy: runInstall — installHooks create-if-absent new hook IS created with chmod 0o755
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/installer/skills.ts:17:47
   if (!cliOption) return []
 
   const installed: string[] = []
-  const skillsSource = path.join(ASSETS_ROOT, 'upstream', 'skills')
+  const skillsSource = path.join(ASSETS_ROOT, "", 'skills')
   const ownSkillsSource = path.join(ASSETS_ROOT, 'own', 'skills')
   const dest = cliOption.skillsPath
killedBy: runInstall — installConfig file dispatch README.md → copy-if-absent (not mergeMarkdown)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/installer/skills.ts:21:7
   const ownSkillsSource = path.join(ASSETS_ROOT, 'own', 'skills')
   const dest = cliOption.skillsPath
 
-  if (!dryRun) {
+  if (false) {
     await fs.ensureDir(dest)
   }
killedBy: runInstall — error isolation if configs throws, hooks still runs (for claude)
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/installer/skills.ts:21:7
   const ownSkillsSource = path.join(ASSETS_ROOT, 'own', 'skills')
   const dest = cliOption.skillsPath
 
-  if (!dryRun) {
+  if (dryRun) {
     await fs.ensureDir(dest)
   }
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/installer/skills.ts:27:37
 
   // Install upstream skills (+ append EXTENSION.md if exists)
   const skillDirs = await fs.readdir(skillsSource)
-  for (const skillDir of skillDirs) {
-    if (skillDir.startsWith('.') || skillDir === '_shared') continue
-    const skillPath = path.join(skillsSource, skillDir)
-    const stat = await fs.stat(skillPath)
-    if (!stat.isDirectory()) continue
-
-    const skillMd = path.join(skillPath, 'SKILL.md')
-    const extensionMd = path.join(skillPath, 'EXTENSION.md')
-
-    if (!await fs.pathExists(skillMd)) continue
-
-    const destDir = path.join(dest, skillDir)
-    if (!dryRun) {
-      await fs.ensureDir(destDir)
-      let content = await fs.readFile(skillMd, 'utf-8')
-      // Append extension if exists
-      if (await fs.pathExists(extensionMd)) {
-        const ext = await fs.readFile(extensionMd, 'utf-8')
-        content = `${content}\n\n---\n\n${ext}`
-      }
-      await fs.writeFile(path.join(destDir, 'SKILL.md'), content, 'utf-8')
-    }
-    installed.push(skillDir)
-  }
+  for (const skillDir of skillDirs) {}
 
   // Install _shared conventions
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] MethodExpression
src/installer/skills.ts:28:9
   // Install upstream skills (+ append EXTENSION.md if exists)
   const skillDirs = await fs.readdir(skillsSource)
   for (const skillDir of skillDirs) {
-    if (skillDir.startsWith('.') || skillDir === '_shared') continue
+    if (skillDir.endsWith('.') || skillDir === '_shared') continue
     const skillPath = path.join(skillsSource, skillDir)
     const stat = await fs.stat(skillPath)
killedBy: runInstall — installConfig file dispatch .json files → mergeJsonFile
statusReason: expected "vi.fn()" to be called at least once

[Killed] LogicalOperator
src/installer/skills.ts:28:9
   // Install upstream skills (+ append EXTENSION.md if exists)
   const skillDirs = await fs.readdir(skillsSource)
   for (const skillDir of skillDirs) {
-    if (skillDir.startsWith('.') || skillDir === '_shared') continue
+    if (skillDir.startsWith('.') && skillDir === '_shared') continue
     const skillPath = path.join(skillsSource, skillDir)
     const stat = await fs.stat(skillPath)
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/installer/skills.ts:31:9
     if (skillDir.startsWith('.') || skillDir === '_shared') continue
     const skillPath = path.join(skillsSource, skillDir)
     const stat = await fs.stat(skillPath)
-    if (!stat.isDirectory()) continue
+    if (stat.isDirectory()) continue
 
     const skillMd = path.join(skillPath, 'SKILL.md')
killedBy: runInstall — installConfig file dispatch .json files → mergeJsonFile
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/installer/skills.ts:31:9
     if (skillDir.startsWith('.') || skillDir === '_shared') continue
     const skillPath = path.join(skillsSource, skillDir)
     const stat = await fs.stat(skillPath)
-    if (!stat.isDirectory()) continue
+    if (true) continue
 
     const skillMd = path.join(skillPath, 'SKILL.md')
killedBy: installSkillsForCLI dryRun: returns correct skill names without creating files
statusReason: expected [ '_shared', …(2) ] to include 'react-19'

[Killed] StringLiteral
src/installer/skills.ts:33:42
     const stat = await fs.stat(skillPath)
     if (!stat.isDirectory()) continue
 
-    const skillMd = path.join(skillPath, 'SKILL.md')
+    const skillMd = path.join(skillPath, "")
     const extensionMd = path.join(skillPath, 'EXTENSION.md')
 
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/installer/skills.ts:36:9
     const skillMd = path.join(skillPath, 'SKILL.md')
     const extensionMd = path.join(skillPath, 'EXTENSION.md')
 
-    if (!await fs.pathExists(skillMd)) continue
+    if (false) continue
 
     const destDir = path.join(dest, skillDir)
killedBy: installSkillsForCLI dryRun: does not include no-skill-dir (no SKILL.md)
statusReason: expected [ 'no-skill-dir', 'react-19', …(5) ] to not include 'no-skill-dir'

[Killed] BooleanLiteral
src/installer/skills.ts:36:9
     const skillMd = path.join(skillPath, 'SKILL.md')
     const extensionMd = path.join(skillPath, 'EXTENSION.md')
 
-    if (!await fs.pathExists(skillMd)) continue
+    if (await fs.pathExists(skillMd)) continue
 
     const destDir = path.join(dest, skillDir)
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/installer/skills.ts:39:9
     if (!await fs.pathExists(skillMd)) continue
 
     const destDir = path.join(dest, skillDir)
-    if (!dryRun) {
+    if (dryRun) {
       await fs.ensureDir(destDir)
       let content = await fs.readFile(skillMd, 'utf-8')
killedBy: installSkillsForCLI dryRun: returns correct skill names without creating files
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/installer/skills.ts:39:9
     if (!await fs.pathExists(skillMd)) continue
 
     const destDir = path.join(dest, skillDir)
-    if (!dryRun) {
+    if (false) {
       await fs.ensureDir(destDir)
       let content = await fs.readFile(skillMd, 'utf-8')
killedBy: installSkillsForCLI installs upstream skill without EXTENSION.md (content exact match)
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-skills-claude-dest-test/react-19/SKILL.md'

[Killed] ConditionalExpression
src/installer/skills.ts:43:11
       await fs.ensureDir(destDir)
       let content = await fs.readFile(skillMd, 'utf-8')
       // Append extension if exists
-      if (await fs.pathExists(extensionMd)) {
+      if (false) {
         const ext = await fs.readFile(extensionMd, 'utf-8')
         content = `${content}\n\n---\n\n${ext}`
killedBy: installSkillsForCLI installs upstream skill WITH EXTENSION.md: content = SKILL.md + separator + EXTENSION.md
statusReason: expected '# SDD Explore' to be '# SDD Explore\n\n---\n\n## Extension:…' // Object.is equality

[Killed] BlockStatement
src/installer/skills.ts:43:45
       await fs.ensureDir(destDir)
       let content = await fs.readFile(skillMd, 'utf-8')
       // Append extension if exists
-      if (await fs.pathExists(extensionMd)) {
-        const ext = await fs.readFile(extensionMd, 'utf-8')
-        content = `${content}\n\n---\n\n${ext}`
-      }
+      if (await fs.pathExists(extensionMd)) {}
       await fs.writeFile(path.join(destDir, 'SKILL.md'), content, 'utf-8')
     }
killedBy: installSkillsForCLI installs upstream skill WITH EXTENSION.md: content = SKILL.md + separator + EXTENSION.md
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-skills-claude-dest-test/react-19/SKILL.md'

[Killed] StringLiteral
src/installer/skills.ts:53:45
   }
 
   // Install _shared conventions
-  const sharedSrc = path.join(skillsSource, '_shared')
+  const sharedSrc = path.join(skillsSource, "")
   if (await fs.pathExists(sharedSrc)) {
     const sharedDest = path.join(dest, '_shared')
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-installer-index-assets-test/configs/claude/test.json'

[Killed] ConditionalExpression
src/installer/skills.ts:54:7
 
   // Install _shared conventions
   const sharedSrc = path.join(skillsSource, '_shared')
-  if (await fs.pathExists(sharedSrc)) {
+  if (false) {
     const sharedDest = path.join(dest, '_shared')
     if (!dryRun) {
killedBy: runInstall — onStep callbacks orchestrators success: emits running then done
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/installer/skills.ts:54:7
 
   // Install _shared conventions
   const sharedSrc = path.join(skillsSource, '_shared')
-  if (await fs.pathExists(sharedSrc)) {
+  if (true) {
     const sharedDest = path.join(dest, '_shared')
     if (!dryRun) {
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/installer/skills.ts:56:9
   const sharedSrc = path.join(skillsSource, '_shared')
   if (await fs.pathExists(sharedSrc)) {
     const sharedDest = path.join(dest, '_shared')
-    if (!dryRun) {
+    if (true) {
       await fs.ensureDir(sharedDest)
       await fs.copy(sharedSrc, sharedDest, { overwrite: true })
killedBy: installSkillsForCLI dryRun: returns correct skill names without creating files
statusReason: ENOENT: no such file or directory, copyfile '/tmp/javi-ai-skills-test-suite/upstream/skills/_shared/persistence-contract.md' -> '/tmp/javi-ai-skills-claude-dest-test/_shared/persistence-contract.md'

[Killed] BooleanLiteral
src/installer/skills.ts:56:9
   const sharedSrc = path.join(skillsSource, '_shared')
   if (await fs.pathExists(sharedSrc)) {
     const sharedDest = path.join(dest, '_shared')
-    if (!dryRun) {
+    if (dryRun) {
       await fs.ensureDir(sharedDest)
       await fs.copy(sharedSrc, sharedDest, { overwrite: true })
killedBy: runInstall — installHooks create-if-absent new hook IS created with chmod 0o755
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/installer/skills.ts:58:57
     const sharedDest = path.join(dest, '_shared')
     if (!dryRun) {
       await fs.ensureDir(sharedDest)
-      await fs.copy(sharedSrc, sharedDest, { overwrite: true })
+      await fs.copy(sharedSrc, sharedDest, { overwrite: false })
     }
     installed.push('_shared')
killedBy: installSkillsForCLI copies _shared directory with overwrite
statusReason: expected 'Modified' to be '# Shared' // Object.is equality

[Killed] ConditionalExpression
src/installer/skills.ts:64:7
   }
 
   // Install own skills
-  if (await fs.pathExists(ownSkillsSource)) {
+  if (true) {
     const ownDirs = await fs.readdir(ownSkillsSource)
     for (const skillDir of ownDirs) {
killedBy: runInstall — feature routing does NOT install skills when "skills" is NOT in features
statusReason: ENOTEMPTY: directory not empty, rmdir '/tmp/javi-ai-installer-index-assets-test'

[Killed] ConditionalExpression
src/installer/skills.ts:64:7
   }
 
   // Install own skills
-  if (await fs.pathExists(ownSkillsSource)) {
+  if (false) {
     const ownDirs = await fs.readdir(ownSkillsSource)
     for (const skillDir of ownDirs) {
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/installer/skills.ts:66:37
   // Install own skills
   if (await fs.pathExists(ownSkillsSource)) {
     const ownDirs = await fs.readdir(ownSkillsSource)
-    for (const skillDir of ownDirs) {
-      if (skillDir.startsWith('.')) continue
-      const skillPath = path.join(ownSkillsSource, skillDir)
-      const destDir = path.join(dest, skillDir)
-      if (!dryRun) {
-        await fs.copy(skillPath, destDir, { overwrite: true })
-      }
-      installed.push(skillDir)
-    }
+    for (const skillDir of ownDirs) {}
   }
 
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/installer/skills.ts:67:11
   if (await fs.pathExists(ownSkillsSource)) {
     const ownDirs = await fs.readdir(ownSkillsSource)
     for (const skillDir of ownDirs) {
-      if (skillDir.startsWith('.')) continue
+      if (false) continue
       const skillPath = path.join(ownSkillsSource, skillDir)
       const destDir = path.join(dest, skillDir)
killedBy: installSkillsForCLI installs upstream skill WITH EXTENSION.md: content = SKILL.md + separator + EXTENSION.md
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-skills-claude-dest-test/sdd-explore/SKILL.md'

[Killed] MethodExpression
src/installer/skills.ts:67:11
   if (await fs.pathExists(ownSkillsSource)) {
     const ownDirs = await fs.readdir(ownSkillsSource)
     for (const skillDir of ownDirs) {
-      if (skillDir.startsWith('.')) continue
+      if (skillDir.endsWith('.')) continue
       const skillPath = path.join(ownSkillsSource, skillDir)
       const destDir = path.join(dest, skillDir)
killedBy: installSkillsForCLI handles missing upstream/skills directory: readdir throws (documents actual behavior)
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-skills-test-suite/upstream/skills/_shared/persistence-contract.md'

[Killed] ConditionalExpression
src/installer/skills.ts:70:11
       if (skillDir.startsWith('.')) continue
       const skillPath = path.join(ownSkillsSource, skillDir)
       const destDir = path.join(dest, skillDir)
-      if (!dryRun) {
+      if (true) {
         await fs.copy(skillPath, destDir, { overwrite: true })
       }
killedBy: runInstall — onStep callbacks orchestrators success: emits running then done
statusReason: expected undefined to be defined

[Survived] BooleanLiteral
src/installer/skills.ts:71:56
       const skillPath = path.join(ownSkillsSource, skillDir)
       const destDir = path.join(dest, skillDir)
       if (!dryRun) {
-        await fs.copy(skillPath, destDir, { overwrite: true })
+        await fs.copy(skillPath, destDir, { overwrite: false })
       }
       installed.push(skillDir)
