[Killed] BlockStatement
src/merger/markdown.ts:12:40
   const sourceContent = await fs.readFile(sourcePath, 'utf-8')
   const generated = `${MARKER_START}\n${sourceContent}\n${MARKER_END}`
 
-  if (await fs.pathExists(targetPath)) {
-    if (backupPath) {
-      await fs.copy(targetPath, backupPath)
-    }
-    const targetContent = await fs.readFile(targetPath, 'utf-8')
-    const startIdx = targetContent.indexOf(MARKER_START)
-    const endIdx = targetContent.indexOf(MARKER_END)
-
-    if (startIdx !== -1 && endIdx !== -1) {
-      // replace between markers
-      const before = targetContent.substring(0, startIdx)
-      const after = targetContent.substring(endIdx + MARKER_END.length)
-      await fs.writeFile(targetPath, `${before}${generated}${after}`, 'utf-8')
-    } else {
-      // append at end
-      await fs.writeFile(targetPath, `${targetContent}\n\n${generated}\n`, 'utf-8')
-    }
-  } else {
+  if (await fs.pathExists(targetPath)) {} else {
     await fs.ensureDir(targetPath.substring(0, targetPath.lastIndexOf('/')))
     await fs.writeFile(targetPath, `${generated}\n`, 'utf-8')
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] EqualityOperator
src/merger/markdown.ts:20:9
     const startIdx = targetContent.indexOf(MARKER_START)
     const endIdx = targetContent.indexOf(MARKER_END)
 
-    if (startIdx !== -1 && endIdx !== -1) {
+    if (startIdx === -1 && endIdx !== -1) {
       // replace between markers
       const before = targetContent.substring(0, startIdx)
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/merger/markdown.ts:20:9
     const startIdx = targetContent.indexOf(MARKER_START)
     const endIdx = targetContent.indexOf(MARKER_END)
 
-    if (startIdx !== -1 && endIdx !== -1) {
+    if (false) {
       // replace between markers
       const before = targetContent.substring(0, startIdx)
killedBy: runInstall — feature routing installs configs when "configs" is in features
statusReason: expected "vi.fn()" to be called at least once

[Killed] MethodExpression
src/merger/markdown.ts:22:22
 
     if (startIdx !== -1 && endIdx !== -1) {
       // replace between markers
-      const before = targetContent.substring(0, startIdx)
+      const before = targetContent
       const after = targetContent.substring(endIdx + MARKER_END.length)
       await fs.writeFile(targetPath, `${before}${generated}${after}`, 'utf-8')
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/merger/markdown.ts:23:21
     if (startIdx !== -1 && endIdx !== -1) {
       // replace between markers
       const before = targetContent.substring(0, startIdx)
-      const after = targetContent.substring(endIdx + MARKER_END.length)
+      const after = targetContent
       await fs.writeFile(targetPath, `${before}${generated}${after}`, 'utf-8')
     } else {
killedBy: runInstall — installConfig file dispatch .json files → mergeJsonFile
statusReason: expected "vi.fn()" to be called at least once

[Killed] ArithmeticOperator
src/merger/markdown.ts:23:45
     if (startIdx !== -1 && endIdx !== -1) {
       // replace between markers
       const before = targetContent.substring(0, startIdx)
-      const after = targetContent.substring(endIdx + MARKER_END.length)
+      const after = targetContent.substring(endIdx - MARKER_END.length)
       await fs.writeFile(targetPath, `${before}${generated}${after}`, 'utf-8')
     } else {
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/merger/markdown.ts:25:12
       const before = targetContent.substring(0, startIdx)
       const after = targetContent.substring(endIdx + MARKER_END.length)
       await fs.writeFile(targetPath, `${before}${generated}${after}`, 'utf-8')
-    } else {
-      // append at end
-      await fs.writeFile(targetPath, `${targetContent}\n\n${generated}\n`, 'utf-8')
-    }
+    } else {}
   } else {
     await fs.ensureDir(targetPath.substring(0, targetPath.lastIndexOf('/')))
killedBy: runInstall — feature routing installs orchestrators when "orchestrators" is in features
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/merger/markdown.ts:29:10
       // append at end
       await fs.writeFile(targetPath, `${targetContent}\n\n${generated}\n`, 'utf-8')
     }
-  } else {
-    await fs.ensureDir(targetPath.substring(0, targetPath.lastIndexOf('/')))
-    await fs.writeFile(targetPath, `${generated}\n`, 'utf-8')
-  }
+  } else {}
 }
 
killedBy: runInstall — hooks guard (claude only) hooks ARE installed for claude
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/merger/markdown.ts:30:71
       await fs.writeFile(targetPath, `${targetContent}\n\n${generated}\n`, 'utf-8')
     }
   } else {
-    await fs.ensureDir(targetPath.substring(0, targetPath.lastIndexOf('/')))
+    await fs.ensureDir(targetPath.substring(0, targetPath.lastIndexOf("")))
     await fs.writeFile(targetPath, `${generated}\n`, 'utf-8')
   }
killedBy: runInstall — installOrchestrators dest paths opencode orchestrators go to {configPath}/agents (flat)
statusReason: ENOENT: no such file or directory, open '/tmp/javi-ai-installer-index-assets-test/delta/orchestrators/opencode/agent.md'
