[Killed] StringLiteral
src/installer/manifest.ts:7:12
 import type { Manifest } from '../types/index.js'
 
 const DEFAULT_MANIFEST: Manifest = {
-  version: '0.1.0',
+  version: "",
   installedAt: new Date().toISOString(),
   updatedAt: new Date().toISOString(),
killedBy: readManifest returns DEFAULT_MANIFEST version "0.1.0" when file does not exist
statusReason: expected '' to be '0.1.0' // Object.is equality

[Killed] BlockStatement
src/installer/manifest.ts:23:72
   }
 }
 
-export async function writeManifest(manifest: Manifest): Promise<void> {
-  await fs.ensureDir(path.dirname(MANIFEST_PATH))
-  await fs.writeFile(MANIFEST_PATH, JSON.stringify(manifest, null, 2), 'utf-8')
-}
+export async function writeManifest(manifest: Manifest): Promise<void> {}
 
killedBy: writeManifest creates directory if it does not exist
statusReason: expected false to be true // Object.is equality
