[Killed] BlockStatement
src/commands/doctor.ts:70:36
     }
   }
 
-  if (await fs.pathExists(ownSrc)) {
-    const dirs = await fs.readdir(ownSrc)
-    for (const d of dirs) {
-      if (!d.startsWith('.')) names.add(d)
-    }
-  }
+  if (await fs.pathExists(ownSrc)) {}
 
   return names.size
killedBy: runDoctor skill count: present === expected - 1 → fail
statusReason: expected 'ok' to be 'fail' // Object.is equality

[Killed] MethodExpression
src/commands/doctor.ts:73:12
   if (await fs.pathExists(ownSrc)) {
     const dirs = await fs.readdir(ownSrc)
     for (const d of dirs) {
-      if (!d.startsWith('.')) names.add(d)
+      if (!d.endsWith('.')) names.add(d)
     }
   }
killedBy: runDoctor countExpectedSkills: same skill name in own/ and upstream/ is only counted once
statusReason: expected '2/0 skills present' to contain '2/2'

[Killed] ArrowFunction
src/commands/doctor.ts:135:34
   // ── 3. Skills ──────────────────────────────────────────────────────────────
   const skillChecks: DoctorCheck[] = []
   for (const cli of installedClis) {
-    const opt = CLI_OPTIONS.find(c => c.id === cli)
+    const opt = CLI_OPTIONS.find(() => undefined)
     if (!opt) continue
     const present = await countInstalledSkills(opt.skillsPath)
killedBy: runDoctor skill count matches expected: status ok
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] LogicalOperator
src/commands/doctor.ts:167:7
   const hooksDir = path.join(process.env['HOME'] ?? '~', '.claude', 'hooks')
   const hooksSrc = path.join(ASSETS_ROOT, 'own', 'hooks', 'claude')
 
-  if (installedClis.has('claude') && await fs.pathExists(hooksSrc)) {
+  if (installedClis.has('claude') || (await fs.pathExists(hooksSrc))) {
     const hookFiles = await fs.readdir(hooksSrc)
     for (const hookFile of hookFiles) {
killedBy: runDoctor manifest with 2 CLIs: shows them listed
statusReason: ENOENT: no such file or directory, scandir '/tmp/javi-ai-doctor-assets-test/own/hooks/claude'

[Killed] ConditionalExpression
src/commands/doctor.ts:171:11
     const hookFiles = await fs.readdir(hooksSrc)
     for (const hookFile of hookFiles) {
       const hookPath = path.join(hooksDir, hookFile)
-      if (!await fs.pathExists(hookPath)) {
+      if (true) {
         hookChecks.push({ label: hookFile, status: 'fail', detail: 'not found' })
       } else {
killedBy: runDoctor hook check: hook file exists but is not executable → status fail
statusReason: expected 'not found' to contain 'not executable'
