[Killed] BlockStatement
src/commands/uninstall.ts:66:42
     // Hooks (claude only)
     if (cli === 'claude') {
       const hooksDir = path.join(opt.configPath, 'hooks')
-      if (await fs.pathExists(hooksDir)) {
-        items.push({
-          label: `${hooksDir.replace(process.env['HOME'] ?? '', '~')} (hooks)`,
-          path: hooksDir,
-          type: 'hooks-dir',
-          cli,
-        })
-      }
+      if (await fs.pathExists(hooksDir)) {}
     }
   }
killedBy: buildUninstallPlan claude in manifest: includes skills-dir, hooks-dir, config-section items for .md files
statusReason: expected [ Array(3) ] to include 'hooks-dir'

[Killed] EqualityOperator
src/commands/uninstall.ts:151:34
           const content = await fs.readFile(item.path, 'utf-8')
           const startIdx = content.indexOf(MARKER_START)
           const endIdx = content.indexOf(MARKER_END)
-          if (startIdx !== -1 && endIdx !== -1) {
+          if (startIdx !== -1 && endIdx === -1) {
             const before = content.substring(0, startIdx).trimEnd()
             const after = content.substring(endIdx + MARKER_END.length).trimStart()
killedBy: runUninstall config-section no backup, has markers: markers and content stripped, surrounding preserved
statusReason: expected '# Header\n\nUser content.\n\n<!-- BEG…' not to contain '<!-- BEGIN JAVI-AI -->'

[Killed] MethodExpression
src/commands/uninstall.ts:155:17
             const before = content.substring(0, startIdx).trimEnd()
             const after = content.substring(endIdx + MARKER_END.length).trimStart()
             const result = [before, after].filter(Boolean).join('\n\n')
-            if (result.trim()) {
+            if (result) {
               await fs.writeFile(item.path, result + '\n', 'utf-8')
               removed.push(`${item.label} (section removed)`)
killedBy: runUninstall buildUninstallPlan: README.md is excluded from config-section items
statusReason: expected false to be true // Object.is equality
